[
    {
        "id": 1,
        "name": "Keto Sesame Tuna and Egg Salad",
        "description": "This quick and easy tuna and egg salad is combined with aromatic scallions and parsley and coated in a sesame, lemon mayo.\n\nThis is a great option for stuffing lettuce wraps or topping low carb crackers.",
        "prepareTime": 8,
        "cookTime": 0,
        "ingredients": [
            "Hard Boiled Egg 2 medium",
            "Scallions 2 medium - 4 1/8\" long",
            "Canned Tuna 1-¾ ounce",
            "Lemon Juice, Fresh 1 teaspoon",
            "Parsley, Fresh 1 tablespoon",
            "Sesame Oil 1 teaspoon",
            "Mayonnaise 1 tablespoon",
            "Sesame Seeds, Hulled, Toasted, Unsalted 1 teaspoon, whole pieces",
            "Salt, Sea Salt ⅛ teaspoon",
            "Black Pepper ⅛ teaspoon"
        ],
        "steps": [
            "Peel and roughly chop the eggs and add to a mixing bowl.",
            "Thinly slice the scallions and roughly chop the parsley. Add to the mixing bowl along with the tuna and stir well to combine.",
            "Add the mayonnaise to a mixing bowl with the lemon juice, sesame oil, salt and pepper. Whisk together until smooth.",
            "Spoon the dressing over the salad and stir well to coat.",
            "Sprinkle over the sesame seeds to serve."
        ],
        "nutrients": {
            "caloriesKCal": 170.313,
            "totalCarbs": 2.366,
            "sugar": 1.166,
            "protein": 11.004,
            "fat": 13.018,
            "cholesterol": 175.938,
            "alcohol": 0,
            "gluten": 0
        },
        "image": "https://tinyurl.com/2p82zzca/133fcdec-4595-44be-a302-02df4c209451.png"
    },
    {
        "id": 2,
        "name": "Keto Vanilla Butter Latte",
        "description": "This creamy Keto vanilla BULLETPROOF® coffee recipe is rich in fats, frothy plant-based milk, and a hint of sweet vanilla. This Keto vanilla butter coffee makes a great fat-fueled breakfast option to kickstart your day. Alternatively, this is perfect served with a slice of low-carb cake as an afternoon treat!\n\n### What ingredients are in this Keto vanilla butter latte?\n\nThis Keto vanilla BULLETPROOF® coffee is prepared with hot almond milk infused with sweet vanilla extract. The milk is then blended with instant coffee and a hearty helping of unsalted butter, before being blitzed until super frothy! We have used a handheld stick blender to froth and blend our Keto coffee, however, you may use a freestanding blender for this if preferred.\n\n### Here are some tips to make Keto vanilla butter coffee?\n\nThis Keto BULLETPROOF® coffee provides a generous serving of fats from unsalted butter. If preferred you may swap the butter for coconut oil or BULLETPROOF® brain octane oil (MCT Oil) or even a blend of fats. You may also swap the erythritol for your preference in low-carb sweetener or omit it entirely if desired. Please be sure to adjust your macros for any changes made.\n\n### Can you use freshly brewed coffee in this Keto recipe?\n\nWhile this recipe calls for instant coffee, you can definitely substitute it for espresso or freshly brewed coffee, just make sure its strong.\n\nBULLETPROOF® is a registered trademark owned by Bulletproof Digital, Inc.",
        "prepareTime": 8,
        "cookTime": 3,
        "ingredients": [
            "Butter, Unsalted 1-½ tablespoon",
            "Almond Milk, Vanilla Or Other Flavors, Unsweetened 1-½ cup",
            "Instant Coffee 1 teaspoon",
            "Vanilla Extract ¼ teaspoon",
            "100% Pure Erythritol by Now 1 tsp"
        ],
        "steps": [
            "Add the almond milk and vanilla extract to a small saucepan over low/medium heat. Stir to combine. Heat the milk through until piping hot but not boiling.",
            "Add the instant coffee to a large mug. Add the granulated sweetener. Add the hot milk and stir well to combine, dissolving the coffee and sweetener.",
            "Add the butter to the mug. Stir well to combine. Let the butter completely melt into the milky coffee.",
            "Carefully use a hand held stick blender or milk frother and blend the coffee and butter. Continue blending until you have a thick frothy layer on the top of your coffee. Serve hot."
        ],
        "nutrients": {
            "caloriesKCal": 203.555,
            "totalCarbs": 5.903,
            "sugar": 0.572,
            "protein": 1.779,
            "fat": 21.015,
            "cholesterol": 45.755,
            "alcohol": 0.631,
            "gluten": 0
        },
        "image": "https://tinyurl.com/2p82zzca/ccef957b-351f-4c14-b33c-ef050045b877.png"
    },
    {
        "id": 3,
        "name": "Keto Bird Nests",
        "description": "This deliciously low-carb breakfast is light to eat and totally instagram-worthy! Spiralized zucchini noodles are gently seasoned and are each a vibrant bed to a single egg. Feel free to expand on this recipe and add additional seasonings or herbs. You can even add a little cheese for more fat and protein!\n\nJessica L.",
        "prepareTime": 10,
        "cookTime": 20,
        "ingredients": [
            "Zucchini 8-½ ounce",
            "Olive Oil 2-½ teaspoon",
            "Raw Egg 4 large",
            "Salt 1 teaspoon",
            "Black Pepper 1 teaspoon"
        ],
        "steps": [
            "Preheat an oven to 350 degrees and line a sheet tray with aluminum foil or simply grease it. Spiralize a large zucchini, and break up the spirals slightly with your fingers.",
            "Divide the zucchini into 4 sections (just slightly over 2 oz. each), and arrange them into “nests” on your sheet tray. Create a small space in the center of each nest. Then, drizzle the olive oil gently across the zucchini.",
            "Crack an egg into each zucchini nest. Sprinkle about ¼ tsp each of the salt and pepper over each bird nest.",
            "Bake the bird nests for approx 20 minutes. This is enough time for the eggs to fully cook and the zucchini to turn just slightly golden on the edges. Allow the tray to cool for 2-3 minutes before transferring the finished recipe to plates with a spatula.",
            "You may cook the bird nests for less than 20 minutes, if you want runnier eggs!"
        ],
        "nutrients": {
            "caloriesKCal": 114.047,
            "totalCarbs": 2.801,
            "sugar": 2.07,
            "protein": 7.079,
            "fat": 8.329,
            "cholesterol": 186.5,
            "alcohol": 0,
            "gluten": 0
        },
        "image": "https://tinyurl.com/2p82zzca/348b12ac-3cf3-44a7-b193-4c686a07c0f2.png"
    },
    {
        "id": 4,
        "name": "Keto Thai Spicy Peanut Chicken With Asian Slaw",
        "description": "Do you love Thai food? This Thai-inspired chicken dish is a little spicy, a little nutty from some peanut butter, and tossed with fresh herbs. A cool and creamy Asian slaw is paired on the side to combat any heat from the chili sauce. You can have your lunch or dinner ready in 20 minutes or less! You can double this recipe for 4 days of meal prep as well.\n\nJessica L.",
        "prepareTime": 10,
        "cookTime": 8,
        "ingredients": [
            "Packaged Salads Fresh Favorites Colorful Coleslaw by Dole 1 cups",
            "Salt 0.25 teaspoon",
            "Rice Vinegar 1 teaspoon",
            "Mayo 1 tablespoon",
            "Sesame Seeds ¼ teaspoon, whole pieces",
            "Lime Juice, Fresh 1 wedge - juice from one wedge or slice",
            "Boneless Skinless Chicken Breast 10 ounce",
            "Olive Oil ½ tablespoon",
            "Black Pepper 0.25 teaspoon",
            "Peanut Butter 1 tablespoon",
            "Sambal Oelek Paste Of Chili by Rooster 1 tablespoon",
            "Soy Sauce 2 tablespoon",
            "Cilantro ½ tablespoon, chopped",
            "Basil 4 leaf",
            "Lime Juice, Fresh 2 wedge - juice from one wedge or slice"
        ],
        "steps": [
            "In a bowl, combine the slaw mix, salt, vinegar, mayo, sesame seeds, and first amount of lime juice. Set this slaw mixture aside for later, giving the salt time to draw out the juices.",
            "Trim any unwanted fat from your chicken, and chop the chicken into 1-inch cubes.",
            "Heat the olive oil in a medium sized pan on medium-high heat. Toss in the chicken and black pepper, and cook these ingredients until the chicken just cooks through.",
            "Use a wooden spoon to move the chicken the the outer edges of the pan and turn the heat to very low. Place the peanut butter, chili sauce, and soy sauce in the exposed center of the pan.",
            "Let the heat melt the peanut butter slightly, then stir and combine the chicken and sauce into a consistent and creamy mixture.",
            "Finally, chop the cilantro and basil and toss these with the chicken.",
            "Serve the hot chicken with the cool slaw and two lime wedges. You can add extra cilantro as a garnish at your discretion. Enjoy!"
        ],
        "nutrients": {
            "caloriesKCal": 394.486,
            "totalCarbs": 5.723,
            "sugar": 2.351,
            "protein": 47.457,
            "fat": 19.403,
            "cholesterol": 123.372,
            "alcohol": 0,
            "gluten": 0
        },
        "image": "https://tinyurl.com/2p82zzca/2b3146d9-f265-48f1-8142-6d445ad8f4a8.png"
    },
    {
        "id": 5,
        "name": "Keto Green Beans and Scallions",
        "description": "These aromatic green beans are cooked with tender scallions, spicy chili flakes, a hint of zesty lime and sesame oil.\n\nThese are a great accompaniment to Asian inspired dishes or grilled fish.",
        "prepareTime": 5,
        "cookTime": 12,
        "ingredients": [
            "Green Beans (string Beans), Raw 5 ounce",
            "Lime Juice, Fresh 2 teaspoon",
            "Scallions 2 medium - 4 1/8\" long",
            "Olive Oil 1-½ tablespoon",
            "Hot Chili Pepper, Dried, With Seeds 1 teaspoon",
            "Sesame Oil 1 teaspoon",
            "Salt, Sea Salt ¼ teaspoon",
            "Black Pepper ⅛ teaspoon"
        ],
        "steps": [
            "Add the green beans to a pan of boiling water and simmer for 4-5 minutes until tender. Drain completely.",
            "Thinly slice the scallions. Heat a tablespoon of olive oil in a skillet over a low/medium heat. Add the scallions and sauté for 2-3 minutes until tender.",
            "Whisk together the remaining olive oil, sesame oil, lime juice, chili flakes, salt and pepper. Add the green beans to the pan and drizzle over the spiced oil. Stir well to combine and cook for a further minute or two to heat the beans through."
        ],
        "nutrients": {
            "caloriesKCal": 70.591,
            "totalCarbs": 3.578,
            "sugar": 1.619,
            "protein": 0.869,
            "fat": 6.341,
            "cholesterol": 0,
            "alcohol": 0,
            "gluten": 0
        },
        "image": "https://tinyurl.com/2p82zzca/1a69a125-7c33-4664-b4c2-f4fdddab8781.png"
    },
    {
        "id": 6,
        "name": "Low Carb Spiced Bok Choy and Broccoli Soup",
        "description": "This warming soup is packed with low carb broccoli and Bok choy, aromatic cumin, fiery ginger and topped with spicy chili flakes to serve.\n\nThis makes a great lunch or dinner option served with a slice of keto bread.",
        "prepareTime": 8,
        "cookTime": 13,
        "ingredients": [
            "Vegetable Broth, Bouillon Or Consomme 4 cup",
            "Cilantro 2 tablespoon",
            "Bok Choy 1 cup",
            "Olive Oil 1 tablespoon",
            "Ginger Root, Raw 1 slice - 1\" diameter",
            "Broccoli Florets 1 cups",
            "Shallot 1 tablespoon, chopped",
            "Garlic 1 clove",
            "Hot Chili Pepper, Dried, With Seeds 1 teaspoon",
            "Cumin, Seed ½ teaspoon"
        ],
        "steps": [
            "Thinly slice the shallot and garlic. Heat the oil in a large saucepan over a low/medium heat. Add the garlic and shallots and sweat gently until tender.",
            "Slice the tough base from the Bok choy to separate the individual stalks. Cut the leaves from the stalks and reserve to one side. Grate the ginger and add to the pan along with the broccoli florets, Bok choy stalks and cumin seeds. Stir to combine and cook for 2-3 minutes to soften the vegetables and toast the cumin seeds.",
            "Add the stock and bring to a gentle boil. Simmer for 5-6 minutes or until the vegetables are fork tender.",
            "Add the Bok choy leaves and stir until just wilted. Transfer to a blender or use a handheld stick blender and process until smooth.",
            "Scatter with dried chili flakes and fresh cilantro to serve."
        ],
        "nutrients": {
            "caloriesKCal": 68,
            "totalCarbs": 6.005,
            "sugar": 1.978,
            "protein": 2.983,
            "fat": 3.912,
            "cholesterol": 0,
            "alcohol": 0,
            "gluten": 0
        },
        "image": "https://tinyurl.com/2p82zzca/682207ec-7c88-4eb4-84d8-ddd1703d9346.png"
    },
    {
        "id": 7,
        "name": "Keto Blue Cheese Dressing",
        "description": "This quick and easy blue cheese dressing is rich, creamy and perfect for adding a boost of fats and flavor to your Keto meals. Simple to prepare, this blue cheese dressing does not require any cooking and is ready in just a matter of minutes. A great dressing to have on hand in the fridge, ready to drizzle over salads and meats or for dipping low carb vegetables.\n\n### Is Blue Cheese Dressing Keto?\n\nIt’s very simple to make your own Keto-friendly blue cheese dressing. Store-bought versions may contain added fillers and sugars that are not Keto-friendly, but our low carb dressing is so quick to prepare there’s no need to reach for shop-bought again! Our quick and easy Keto dressing combines natural yogurt, mayonnaise, a hint of lemon, a touch of garlic and tangy blue cheese. The ingredients are mixed together until creamy, creating a delicious and pourable dressing.\n\n### Serving Suggestions\n\nThis thick and creamy dressing is versatile in its uses. The dressing can be thinned as desired, perfect for drizzling over your favorite Keto salads. Alternatively, you can keep the dressing slightly thicker, perfect served with meats. We love to pair our blue cheese dressing with Keto burgers. It is also delicious added to salads with crispy bacon.",
        "prepareTime": 8,
        "cookTime": 0,
        "ingredients": [
            "Water 1 tablespoon",
            "Lemon Juice 1 teaspoon",
            "Dannon All Natural Yogurt, Plain ⅓ cup",
            "Mayonnaise ⅓ cup",
            "Blue Cheese ⅓ cup",
            "Black Pepper ⅛ teaspoon",
            "Garlic, Powder ¼ teaspoon"
        ],
        "steps": [
            "Add the yogurt, mayonnaise and lemon juice to a mixing bowl. You may use a homemade or sugar-free store-bought mayonnaise. You may also use any plain yogurt you desire. Be sure to adjust your macros for any changes made. Whisk the yogurt, mayonnaise and lemon juice together to combine until smooth.",
            "Crumble the blue cheese into the mayo and yogurt mix. You can crumble the cheese roughly so you have a mixture of large chunks and smaller pieces. Add the garlic powder and black pepper. You can omit or adjust the quantities of these seasonings as desired. Mix together well to combine, distributing the cheese evenly throughout the dressing. If you would prefer an entirely smooth dressing you can prepare this in a food processor, blending until smooth.",
            "Add the water to the dressing and whisk well to combine. This can be omitted or increased to suit your personal preference. Add more water for a thinner salad dressing or omit entirely if you want a thicker dressing for topping meats and burgers. Refrigerate in an airtight container until ready to serve."
        ],
        "nutrients": {
            "caloriesKCal": 211.721,
            "totalCarbs": 1.823,
            "sugar": 1.197,
            "protein": 5.384,
            "fat": 20.375,
            "cholesterol": 25.964,
            "alcohol": 0,
            "gluten": 0
        },
        "image": "https://tinyurl.com/2p82zzca/2a4fac4d-b935-4360-b72c-934e34895681.png"
    },
    {
        "id": 8,
        "name": "Keto One Pan Garlic Butter Chicken Thighs",
        "description": "These simple one pan chicken thighs are cooked in a generous helping of butter alongside aromatic garlic, rosemary and lemon.\n\nPerfect for a quick and easy weeknight meal with minimal washing up!",
        "prepareTime": 5,
        "cookTime": 20,
        "ingredients": [
            "Chicken Thigh, Skin Removed Before Cooking 4 medium",
            "Garlic 3 clove",
            "Unsalted Butter 2 tablespoon",
            "Lemon Peel Or Zest Raw 2 tsp",
            "Olive Oil 1 tablespoon",
            "Rosemary 1 x 1 x sprig",
            "Salt, Sea Salt ¼ teaspoon",
            "Black Pepper ⅛ teaspoon"
        ],
        "steps": [
            "Heat the olive oil in a large frying pan or skillet over a medium heat and add the chicken thighs. Fry the thighs until they just start to colour.",
            "Add the butter to the pan and continue to cook the chicken until golden brown all over. Set aside.",
            "Reduce the heat, slice the garlic and add to the pan cooking gently in the butter until fragrant, taking care not to burn the butter or garlic.",
            "Return the chicken thighs to the pan along with the lemon zest and tear in the rosemary.",
            "Continue to cook over a medium heat, spooning the hot butter over the chicken until completely cooked through and no longer pink. Serve with steamed green beans or broccoli."
        ],
        "nutrients": {
            "caloriesKCal": 418.52,
            "totalCarbs": 1.96,
            "sugar": 0.138,
            "protein": 40.354,
            "fat": 26.988,
            "cholesterol": 214.822,
            "alcohol": 0,
            "gluten": 0
        },
        "image": "https://tinyurl.com/2p82zzca/1f11e666-3601-4f21-9cf2-c9c7427481b7.png"
    },
    {
        "id": 9,
        "name": "Keto Tahini, Tamari Mushrooms",
        "description": "These simple mushrooms are pan fried until tender then tossed with creamy tahini and tangy tamari sauce.\n\nThese make a great side dish to Asian inspired meals.",
        "prepareTime": 3,
        "cookTime": 8,
        "ingredients": [
            "Mushrooms 6 medium",
            "Coconut Oil 1 tablespoon",
            "Tahini 1 teaspoon",
            "Tamari Sauce 1 tablespoon"
        ],
        "steps": [
            "Melt the coconut oil in a skillet over a medium heat. Thinly slice the mushrooms and add to the skillet, cook through for 6-7 minutes until browned all over and tender.",
            "Add the tahini and tamari and stir well, melting the tahini into the mushrooms. Cook briefly until the mushrooms are golden and coated in tamari and tahini. Serve hot. "
        ],
        "nutrients": {
            "caloriesKCal": 91.746,
            "totalCarbs": 2.683,
            "sugar": 1.15,
            "protein": 2.742,
            "fat": 8.322,
            "cholesterol": 0,
            "alcohol": 0,
            "gluten": 0.036
        },
        "image": "https://tinyurl.com/2p82zzca/e77c981f-193e-42d6-b250-47150568c661.png"
    },
    {
        "id": 10,
        "name": "Keto Chocolate Cake Donuts",
        "description": "I love how soft, moist and chocolatey these donuts are!  They are full of rich chocolate flavor and great with a morning cup of coffee!",
        "prepareTime": 10,
        "cookTime": 15,
        "ingredients": [
            "Almond Flour 1-¼ cup",
            "Brown Sugar Replacement by Swerve ⅓ cup",
            "Baking Powder 1 teaspoon",
            "100% Cocoa Special Dark by Hershey's 3 tbsp",
            "Extra Virgin Olive Oil 1-½ tablespoon",
            "Original Coconut Milk Unsweetened by Silk 2 tablespoon",
            "Raw Egg 2 large",
            "Vanilla Extract 1 teaspoon",
            "Coarse Kosher Salt by Morton ⅛ tsp",
            "The Ultimate Icing Sugar Replacement by Swerve ⅓ cup",
            "Original Coconut Milk Unsweetened by Silk 3 tablespoon",
            "Vanilla Extract ¼ teaspoon"
        ],
        "steps": [
            "Preheat an oven to 350 F.  Prepare a donut pan with nonstick cooking spray.",
            "In a food processor, combine almond flour, sweetener, dark cocoa powder and baking powder together.  Pulse to combine.",
            "Add in the olive oil, milk, eggs, vanilla extract and ⅛ t kosher salt.  Pulse to turn into a smooth batter. ",
            "Spoon and smooth batter evenly into the donut pan to make 6 donuts.  Being careful not to overfill the pan so as they rise the dough will not close the center.  You can wipe the centers of the donuts to keep them free of batter.",
            "Bake for 15 minutes or until cooked through.  ",
            "Allow donuts to cool in the pan for 15 minutes before removing to a cooling rack.",
            "In the meantime, prepare the glaze by combining the rest of the Swerve, 3 tablespoons of coconut milk, ¼ t vanilla extract, and a pinch of salt.  Dip the top of each donut into the glaze and then set aside on the rack to dry.  Keep donuts stored in an airtight container for up to one week."
        ],
        "nutrients": {
            "caloriesKCal": 207.871,
            "totalCarbs": 14.628,
            "sugar": 1.382,
            "protein": 7.474,
            "fat": 17.364,
            "cholesterol": 62.167,
            "alcohol": 0.311,
            "gluten": 0
        },
        "image": "https://tinyurl.com/2p82zzca/fe58600a-a0b3-4b72-b0f1-691bd85f3198.png"
    },
    {
        "id": 11,
        "name": "Keto Scrambled Egg and Tuna Avocado Boats",
        "description": "As a delicious breakfast or lunch, soft avocado is overflowing with scrambled eggs and tender tuna. Despite the over-the-top tuna filling, melted layers of cheese act as the ‘glue’ to hold everything in place. Dig in with a spoon or fork!\n\nJessica L.",
        "prepareTime": 8,
        "cookTime": 9,
        "ingredients": [
            "Raw Egg 2 large",
            "Heavy Cream 1 tablespoon",
            "Salt ⅛ teaspoon",
            "Black Pepper, Ground ⅛ teaspoon",
            "Onion Powder ⅛ teaspoon",
            "Paprika ¼ teaspoon",
            "Canned Tuna 1 can - each 5 ounce net weight",
            "Avocado 4-½ ounce",
            "Salt ⅛ teaspoon",
            "Provolone Cheese 2 slice- each 3/4 ounce"
        ],
        "steps": [
            "Preheat an oven to 350 degrees. In a bowl, whisk together the egg, cream, first amount of salt, pepper, onion powder, and paprika. Set this aside near the stove for later.",
            "In a small pan over medium heat, place in the drained tuna. Continually cook and toss the tuna until it starts to turn golden brown and dries out a little.",
            "Turn the stove heat to low and pour the egg mixture into the pan. Slowly stir the egg and tuna until the egg scrambles and is evenly distributed with the tuna. You may wish to leave the egg slightly undercooked, since it will be cooking further in the oven for a few minutes later on.",
            "Prepare a whole avocado by slicing it in half, removing the pit, and scooping out 1-2 tablespoons of fruit from the middle of each half. Sprinkle the second amount of salt over the avocado. Next, set the avocado halves on a sheet tray lined with foil or parchment paper. Use a spoon to fill each avocado half with the scrambled egg tuna filling. Gently pack the filling down, as it piles high. Finally, layer a slice of provolone cheese over each avocado half.",
            "Bake the tray for just a few minutes - until the cheese is melted and the avocado has been warmed."
        ],
        "nutrients": {
            "caloriesKCal": 340.14,
            "totalCarbs": 7.084,
            "sugar": 1.126,
            "protein": 25.731,
            "fat": 24.069,
            "cholesterol": 232.615,
            "alcohol": 0,
            "gluten": 0
        },
        "image": "https://tinyurl.com/2p82zzca/a336c4de-5d90-4a89-90ce-e0bbee045c62.png"
    },
    {
        "id": 12,
        "name": "Keto Instant Pot Beef and Onion Soup",
        "description": "This easy Keto instant pot soup is prepared with just a handful of flavorsome ingredients and pressure cooked in only a matter of minutes. Both low in carbs and Paleo, this beef and onion soup makes a great warming lunch or dinner option. Perfect served with a slice of Keto bread for dipping.\n\n### How to Make Keto Soup\n\nKeto soup is a great addition to your weekly meal rotation. In order to create the best Keto soups, it is best to combine low carb veggies with a source of Keto friendly fats. For our Keto beef and onion soup we have used beef steak and olive oil to provide our fats and complemented this with onion and cauliflower for our veggies. The beef and onion are browned in the instant pot, then pressure cooked in stock for just 8 minutes until the beef is perfectly tender.\n\n### Serving Suggestions\n\nOur Paleo friendly instant pot soup makes a great lunch or light dinner option. We love our soup served with sliced and buttered Keto bread. This is also delicious accompanied by warm Keto bread rolls for dipping.",
        "prepareTime": 5,
        "cookTime": 8,
        "ingredients": [
            "Beef Steak, Porterhouse, Visible Fat Eaten 9 ounce",
            "Beef Broth, Bouillon Or Consomme, Ready-to-serve Can, Low Sodium 4 cup",
            "Olive Oil 2 tablespoon",
            "Cauliflower 2 cup",
            "Onion 1 large",
            "Garlic 1 clove"
        ],
        "steps": [
            "Add the olive oil to your instant pot. Set to sauté and allow the oil to get hot. Whilst the oil is heating, roughly slice the steak into half inch strips. Carefully add the steak strips to the instant pot. Using the sauté function, brown the beef all over.",
            "Whilst the steak browns, thinly slice the onion and 1 large garlic clove. Add the sliced onion and garlic to the instant pot with the steak. Stir well to combine. Sweat the onion and garlic until tender and lightly golden. Take care not to burn the onion or garlic as this will impair the flavor of the soup.",
            "Whilst the onion cooks, dice the cauliflower into bite sized chunks. Add the cauliflower pieces and the stock to the instant pot and stir well to combine. At this point you may season with salt and pepper if you wish. This will depend on the level of seasoning already in your stock. You may also use chicken or vegetable stock if preferred but be sure to adjust your macros for any changes.",
            "Place the lid on the instant pot with the valve set to ‘sealing’ and set to high pressure. Set the time for 8 minutes. After this time, do a quick release to release the steam. Once the pressure has been released and it is safe to do so, open the lid and portion out the soup for serving. Taste and adjust seasonings if required."
        ],
        "nutrients": {
            "caloriesKCal": 292.466,
            "totalCarbs": 6.395,
            "sugar": 2.887,
            "protein": 20.826,
            "fat": 20.381,
            "cholesterol": 61.873,
            "alcohol": 0,
            "gluten": 0
        },
        "image": "https://tinyurl.com/2p82zzca/2d1b92c4-84fd-48ed-ba94-dcb6148170e9.png"
    },
    {
        "id": 13,
        "name": "Keto Vegan Cilantro Lime Rice",
        "description": "Keto Cilantro Lime Rice is the perfect Keto side dish for any Keto or Low Carb Mexican dinner recipe. Tender, sweet cauliflower rice is tossed with freshly squeezed lime juice and chopped cilantro. The best part is it is heated entirely in the microwave, which means this side dish only takes 5 minutes to prep and cook. Keto Cilantro Lime Rice is a great side dish to have ready-to-go in the fridge whenever hunger strikes; simply pair it with any protein of your choice.\n\n### What kind of cauliflower rice should I use?\n\nFeel free to make homemade cauliflower rice, but store-bought is the quickest way to put together this side dish with minimal effort.\n\nhttps://www.carbmanager.com/recipe-detail/ug:9bfcc61a-9ac3-c122-f2e4-bfaa142c0d6f/cauliflower-rice\n\n### What do I do if I do not have a microwave?\n\nYou can heat the cauliflower rice over medium-low heat until hot, and then add the lime and cilantro to the dish at the very end.\n\nWhat other flavors can I add to the dish?\n\n### Utilizing spices like dark chili powder or chipotle powder can spice up this side dish.\n\nServing suggestions\n\n### Keto Cilantro Lime Rice would be delicious with Keto Baja Pork Shoulder:\n\nhttps://www.carbmanager.com/recipe-detail/ug:3b26040619934242853ba66dfe696353/keto-baja-pork-shoulder",
        "prepareTime": 0,
        "cookTime": 0,
        "ingredients": [
            "Cauliflower rice undefined",
            "Cilantro undefined",
            "Lime undefined",
            "Salt, sea salt undefined"
        ],
        "steps": [
            "Place cauliflower rice into a medium-sized microwave-safe bowl. Microwave on high for 4 minutes. \n",
            "In the meantime, wash and chop the cilantro leaves. Add them to the cauliflower rice once heated. Then squeeze on the lime juice and add the salt. Give the mixture a good toss. Taste adding more lime and salt, as desired. Serve immediately.\n"
        ],
        "nutrients": {
            "caloriesKCal": 19.12,
            "totalCarbs": 3.844,
            "sugar": 1.628,
            "protein": 1.391,
            "fat": 0.343,
            "cholesterol": 0,
            "alcohol": 0,
            "gluten": 0
        },
        "image": "https://tinyurl.com/2p82zzca/df9fd021-4abe-4c34-8f46-484e74e71ac5.png"
    },
    {
        "id": 14,
        "name": "Low Carb Simple Ginger and Garlic Fried Cabbage",
        "description": "This quick and easy cabbage is pan fried with tender red onion, aromatic garlic and fiery fresh ginger, drizzled with salty tamari sauce to serve.\n\nThis makes a great side to Asian inspired chicken, pork or fish.",
        "prepareTime": 6,
        "cookTime": 8,
        "ingredients": [
            "Olive Oil 2 tablespoon",
            "Tamari Sauce 1 tablespoon",
            "Red Cabbage 1 cup",
            "Cabbage, Green, Raw 1 cup",
            "Ginger Root, Raw 1 slice - 1\" diameter",
            "Garlic 1 clove",
            "Red Onion ¼ medium - 2 1/2\" diameter"
        ],
        "steps": [
            "Thinly slice the onion and cabbage. Heat the oil in a skillet or wok over a medium/high heat and add the cabbage and onion, cooking for about three minutes to soften.",
            "Grate the ginger and thinly slice the garlic. Add to the pan and stir well to combine. Pan fry over a medium heat for a further 2-3 minutes until the garlic is tender and fragrant and the cabbage is soft.",
            "Stir through the tamari sauce to serve."
        ],
        "nutrients": {
            "caloriesKCal": 78.549,
            "totalCarbs": 4.115,
            "sugar": 1.889,
            "protein": 1.061,
            "fat": 6.845,
            "cholesterol": 0,
            "alcohol": 0,
            "gluten": 0.018
        },
        "image": "https://tinyurl.com/2p82zzca/dce25a9d-8be4-4c4b-afaa-f994ef227f06.png"
    },
    {
        "id": 15,
        "name": "Keto Stir Fried Bell Peppers with Capers and Olives",
        "description": "These simple stir fried peppers are cooked until soft and tender with salty capers and olives, aromatic garlic and a little twist of lemon.\n\nThis is a great topping for grilled meats or fish or added to salads.",
        "prepareTime": 5,
        "cookTime": 8,
        "ingredients": [
            "Black Olives 8 medium",
            "Olive Oil 1-½ tablespoon",
            "Garlic 1 clove",
            "Capers 1 tablespoon, whole pieces",
            "Lemon Peel Or Zest Raw 1 tsp",
            "Yellow Bell Peppers, Raw 1 medium - 2 1/2\" diameter x 2 3/4\"",
            "Red Bell Peppers, Raw ½ medium - 2 1/2\" diameter x 2 3/4\""
        ],
        "steps": [
            "Slice the bell peppers into thin strips. Heat the oil in a skillet over a medium heat and add the pepper strips, cooking for 3-4 minutes to soften.",
            "Crush the garlic, slice the olives and roughly chop the capers. Add to the pan along with the lemon zest and stir well to combine. Cook for a further 2-3 minutes until the peppers are soft and the garlic is tender."
        ],
        "nutrients": {
            "caloriesKCal": 91.258,
            "totalCarbs": 4.948,
            "sugar": 2.959,
            "protein": 0.824,
            "fat": 8.064,
            "cholesterol": 0,
            "alcohol": 0,
            "gluten": 0
        },
        "image": "https://tinyurl.com/2p82zzca/01c3c96f-5d3b-4d0b-b870-9f29c20eef10.png"
    },
    {
        "id": 16,
        "name": "Keto Parmesan, Almond and Chorizo Chips",
        "description": "These quick and easy keto chips are loaded with smokey Spanish chorizo, aromatic rosemary, crunchy flaked almonds and crispy baked parmesan.\n\nThese are an excellent option for snacking and sharing.",
        "prepareTime": 6,
        "cookTime": 6,
        "ingredients": [
            "Almonds, Raw 1-½ tablespoon, sliced",
            "Fresh Food Spanish Chorizo by Sainsbury's 20 gram",
            "Rosemary, Fresh 1 teaspoon",
            "Parmesan Cheese ⅔ cup, grated",
            "Black Pepper ⅛ teaspoon"
        ],
        "steps": [
            "Preheat the oven to 375 degrees Fahrenheit and line a shallow oven tray with baking paper.",
            "Finely dice the chorizo (1.5 tbsp) and finely chop the rosemary. Add to a mixing bowl along with the parmesan, almonds and black pepper. Mix well to combine.",
            "Spoon a heaped tablespoon of the mixture onto the lined baking tray then repeat 5 more times so you have six piles of mixture. Leave a gap between each and press the mixture into a rough circle shape with your hands.",
            "Transfer to the oven to bake for 6 minutes or until hot through, golden and bubbling. Set aside to cool completely and firm."
        ],
        "nutrients": {
            "caloriesKCal": 137.236,
            "totalCarbs": 1.729,
            "sugar": 0.453,
            "protein": 11.068,
            "fat": 9.603,
            "cholesterol": 17.076,
            "alcohol": 0,
            "gluten": 0
        },
        "image": "https://tinyurl.com/2p82zzca/28f03845-6fec-427c-ae69-f537403d0ff4.png"
    },
    {
        "id": 17,
        "name": "Keto Curried Cabbage",
        "description": "This tender cabbage is loaded with aromatic spices, creamy butter and sweet red onion.\n\nThis is a great side to accompany curried meats, rotisserie chicken or lamb chops.",
        "prepareTime": 6,
        "cookTime": 16,
        "ingredients": [
            "Cabbage 2 cup",
            "Unsalted Butter 2 tablespoon",
            "Garlic 1 clove",
            "Cumin, Seed 1 teaspoon",
            "Curry Powder 1 tablespoon",
            "Vegetable Broth, Bouillon Or Consomme ½ cup",
            "Red Onion ¼ medium - 2 1/2\" diameter"
        ],
        "steps": [
            "Heat a tablespoon of butter in a large skillet over a low/medium heat. Finely slice the onion and add to the skillet, cooking gently until tender.",
            "Thinly slice the garlic and add to the pan along with the cumin seeds. Cook for a further minute or two until fragrant.",
            "Thinly slice the cabbage and add to the skillet with the remaining butter and curry powder. Stir well to combine and cook over a medium heat for 4-5 minutes until the cabbage is just tender.",
            "Add the vegetable stock and simmer for 5-6 minutes until all the liquid has evaporated and the cabbage is soft."
        ],
        "nutrients": {
            "caloriesKCal": 80.354,
            "totalCarbs": 6.385,
            "sugar": 2.601,
            "protein": 1.517,
            "fat": 6.161,
            "cholesterol": 15.252,
            "alcohol": 0,
            "gluten": 0
        },
        "image": "https://tinyurl.com/2p82zzca/f36344ed-2a4d-4627-9dd7-9fb604ce0f3d.png"
    },
    {
        "id": 18,
        "name": "Keto Parmesan and Prosciutto Baked Avocado",
        "description": "These simple baked avocado are rolled in grated parmesan and wrapped with prosciutto before cooking until crisp and golden.\n\nThese make a great snack between meals or party appetizer!",
        "prepareTime": 7,
        "cookTime": 10,
        "ingredients": [
            "Prosciutto 4 slice",
            "Avocado 1 each",
            "Parmesan Cheese 1 tablespoon, grated"
        ],
        "steps": [
            "Preheat the oven to 400 degrees Fahrenheit.",
            "Slice the avocado into 8 even wedges.",
            "Sprinkle over the grated Parmesan and roll the avocado slices in the cheese, pressing gently so it sticks.",
            "Tear each prosciutto slice in half and wrap a half around each avocado slice. Transfer to the oven and bake for 10 minutes until the prosciutto is crisp and golden."
        ],
        "nutrients": {
            "caloriesKCal": 160.154,
            "totalCarbs": 5.99,
            "sugar": 0.232,
            "protein": 6.756,
            "fat": 13.05,
            "cholesterol": 13.257,
            "alcohol": 0,
            "gluten": 0
        },
        "image": "https://tinyurl.com/2p82zzca/346c9866-26a3-46d2-8d8e-4259a84f6c26.png"
    },
    {
        "id": 19,
        "name": "Keto Everything Celery Sticks",
        "description": "This 5-minute snack is crunchy, creamy, and flavorful. Everything but the bagel is here in a snack, and the bagel itself is replaced with crunchy, refreshing celery sticks!\n\nJessica L.",
        "prepareTime": 4,
        "cookTime": 1,
        "ingredients": [
            "Celery 4-½ ounce",
            "Cream Cheese 3 ounce",
            "Everything But The Bagel Sesame Seasoning Blend by Trader Joe's 2 tsp"
        ],
        "steps": [
            "Slice away the leaves and hard white base of 2 celery stalks. Cut each stalk in half to yield 4 pieces.",
            "Microwave your cream cheese for 7-10 seconds to get warm. Mix the cream cheese with the everything seasoning.",
            "Spoon the cream cheese mixture into each celery stick. Enjoy!"
        ],
        "nutrients": {
            "caloriesKCal": 179.041,
            "totalCarbs": 4.242,
            "sugar": 2.453,
            "protein": 3.056,
            "fat": 14.755,
            "cholesterol": 42.95,
            "alcohol": 0,
            "gluten": 0
        },
        "image": "https://tinyurl.com/2p82zzca/67b63b11-b5a2-44a8-92ec-33f3180a289e.png"
    },
    {
        "id": 20,
        "name": "Low Carb Autumn Vegetable Medley",
        "description": "There is so much delicious and colorful produce that is in peak season, come Autumn! Many of it can be enjoyed while on the keto diet. This recipe avoids any squash, but the other seasonal vegetables are bright, juicy, and flavorful. A pinch of nutmeg really sets the tone for a chilly atmosphere.\n\nJessica L.",
        "prepareTime": 10,
        "cookTime": 10,
        "ingredients": [
            "Baby Carrots 2 ounce",
            "Brussel Sprouts by Great Value 3 ounce",
            "Cauliflower, Raw 4 ounce",
            "Kale 2-¼ ounce",
            "Butter 2 tablespoon",
            "Salt 0.5 teaspoon",
            "Black Pepper 0.5 teaspoon",
            "Italian Seasoning 1 teaspoon",
            "Garlic Powder 0.25 teaspoon",
            "Onion Powder 0.25 teaspoon",
            "Spices Nutmeg Ground ¼ tsp"
        ],
        "steps": [
            "Prepare all the vegetables first. Give the carrots a small chop. Quarter the brussel sprouts, removing any hard bottoms. Chop the cauliflower. You can chop the kale or simply rip it up with your hands, removing the stem.",
            "Melt the butter in a large skillet over medium-low heat. Toss in the carrots, sprouts, and cauliflower. Leave the kale aside. Coat the veggies in the butter, then cover with a lid and cook on low for about 5 minutes. The firmer vegetables should be tender and the brussel sprouts should be bright green.",
            "Sprinkle all the seasonings over the skillet. Then, place the kale on top. Replace the lid, then let the kale cook down on its own for 2-3 minutes on a low heat. Remove the lid, and continually stir and cook the ingredients until the kale has cooked down significantly and the vegetables have browned edges.",
            "Serve hot!"
        ],
        "nutrients": {
            "caloriesKCal": 83.614,
            "totalCarbs": 6.582,
            "sugar": 2.141,
            "protein": 2.288,
            "fat": 6.096,
            "cholesterol": 15.252,
            "alcohol": 0,
            "gluten": 0
        },
        "image": "https://tinyurl.com/2p82zzca/1a7a2a70-b217-42d5-9a57-a103c089543b.png"
    }
]