[
  {
    "title": "Buku Pintar JavaScript",
    "isbn": "-",
    "author": "Vivian Siahaan, Rismon Hasiholan Sianipar",
    "synopsis": "Buku ini menyuguhkan lebih dari 100 kasus yang diimplementasikan langkah demi langkah. Buku ini ditujukan baik untuk pemula maupun pembelajar berpengalaman, yang hanya memfokuskan dan mendalami hanya pada elemen-elemen penting JavaScript. Buku ini merupakan buku “untuk semua kalangan”, yang didedikasikan untuk mereka yang menginginkan keseimbangan antara sisi teknis bahasa dan elemen-elemen menyenangkan. Buku ini menjelaskan bagaimana bahasa ini diterapkan dimulai dari contoh-contoh yang paling mendasar sampai yang lebih kompleks, dengan progres yang memandu Anda contoh demi contoh sampai Anda menguasainya. Kebutuhan akan contoh-contoh yang baik sangat diperlukan untuk mendapatkan hasil yang baik. Kami berharap bahwa Anda menikmati buku bahasa pemrograman Web ini dengan cara yang menyenangkan.",
    "pageCount": 201,
    "stock": 3,
    "publisher": "BALIGE PUBLISHING",
    "publishedDate": "2020-03-14",
    "lang": "id",
    "imgUrl": "http://books.google.com/books/content?id=qovWDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "status": "available",
    "category": "Computers",
    "pricePerWeek": 3444,
    "link": "http://books.google.co.id/books?id=qovWDwAAQBAJ&printsec=frontcover&dq=javascript&hl=&as_pt=BOOKS&cd=1&source=gbs_api"
  },
  {
    "title": "JavaScript Untuk Profesional",
    "isbn": "-",
    "author": "Vivian Siahaan, Rismon Hasiholan Sianipar",
    "synopsis": "JavaScript merupakan bahasa skript populer yang dipakai untuk menciptakan halaman Web yang dapat berinteraksi dengan pengguna dan dapat merespon event yang terjadi pada halaman. JavaScript merupakan perekat yang menyatukan halaman-halaman Web. Akan sangat susah menjumpai halaman Web komersial yang tidak memuat kode JavaScript. JavaScript, awalnya dikenal sebagai LiveScript, dikembangkan oleh Brendan Eich di Netscape pada tahun 1995 yang menjadi bagian terintegrasi di dalam Netscape Navigator 2.0. JavaScript merupakan bahasa skript yang menghidupkan halaman-halaman HTML. JavaScript dapat dijalankan pada hampir semua platform. JavaScript merupakan bahasa sisi-klien yang didesain pada browser komputer Anda, bukan pada server. Ia dibangun secara langsung ke dalam browser, Microsoft Internet Explorer, Mozilla Firefox, Google Chrome, Opera, hampir semua browser. Dalam sintaksis, JavaScript mirip dengan C, Perl, dan Java. Program JavaScript dipakai untuk mendeteksi dan beraksi terhadap event-event yang disebabkan oleh pengguna. Anda dapat memperbaiki situs Web dengan bantuan navigasional, kotak dialog, citra dinamis, dan lainnya. JavaScript dapat digunakan untuk mengendalikan tampilan halaman. JavaScript dipakai untuk memvalidasi apa yang diketikkan pengguna ke dalam sebuah form sebelum pengiriman form ke server dilakukan. JavaScript berperan sebagai bahasa pemrograman, yang memiliki konstruksi-konstruksi dasar seperti variabel dan tipe data, look kontrol, statemen if/else, statemen switch, fungsi, dan objek. JavaScript dapat dipakai untuk perhitungan aritmatik, pemanipulasian tanggal dan waktu, pemodifikasian array, string dan objek. Ia juga dapat menangani event yang diinisiasi pengguna, dan menetapkan pewaktu. Kombinasi dari HTMl, CSS, dan JavaScript dapat menghasilkan halaman Web yang terstruktur, bergaya, dan interaktif. Para perancang Web sepakat bahwa ketiganya merupakan bagian penting dari sebuah halaman Web. Topik-topik yang dibahas pada buku ini meliputi: Sejarah JavaScript; Tipe Data; Literal, dan Variabel; Kotak Dialog; Operator; Kondisi; Fungsi; Objek; Objek Inti JavaScript; Objek Browser; Form; Citra dan Link; Penanganan Event; CSS dan JavaScript.",
    "pageCount": 434,
    "stock": 5,
    "publisher": "SPARTA PUBLISHER",
    "publishedDate": "2018-11-21",
    "lang": "id",
    "imgUrl": "http://books.google.com/books/content?id=OFd1DwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "status": "available",
    "category": "Computers",
    "pricePerWeek": 1256,
    "link": "http://books.google.co.id/books?id=OFd1DwAAQBAJ&printsec=frontcover&dq=javascript&hl=&as_pt=BOOKS&cd=2&source=gbs_api"
  },
  {
    "title": "JavaScript: Dari A Sampai Z",
    "isbn": "-",
    "author": "Vivian Siahaan, Rismon Hasiholan Sianipar",
    "synopsis": "JavaScript merupakan bahasa skript populer yang dipakai untuk menciptakan halaman Web yang dapat berinteraksi dengan pengguna dan dapat merespon event yang terjadi pada halaman. JavaScript merupakan perekat yang menyatukan halaman-halaman Web. Akan sangat susah menjumpai halaman Web komersial yang tidak memuat kode JavaScript. JavaScript, awalnya dikenal sebagai LiveScript, dikembangkan oleh Brendan Eich di Netscape pada tahun 1995 yang menjadi bagian terintegrasi di dalam Netscape Navigator 2.0. JavaScript merupakan bahasa skript yang menghidupkan halaman-halaman HTML. JavaScript dapat dijalankan pada hampir semua platform. JavaScript merupakan bahasa sisi-klien yang didesain pada browser komputer Anda, bukan pada server. Ia dibangun secara langsung ke dalam browser, Microsoft Internet Explorer, Mozilla Firefox, Google Chrome, Opera, hampir semua browser. Dalam sintaksis, JavaScript mirip dengan C, Perl, dan Java. Program JavaScript dipakai untuk mendeteksi dan beraksi terhadap event-event yang disebabkan oleh pengguna. Anda dapat memperbaiki situs Web dengan bantuan navigasional, kotak dialog, citra dinamis, dan lainnya. JavaScript dapat digunakan untuk mengendalikan tampilan halaman. JavaScript dipakai untuk memvalidasi apa yang diketikkan pengguna ke dalam sebuah form sebelum pengiriman form ke server dilakukan. JavaScript berperan sebagai bahasa pemrograman, yang memiliki konstruksi-konstruksi dasar seperti variabel dan tipe data, look kontrol, statemen if/else, statemen switch, fungsi, dan objek. JavaScript dapat dipakai untuk perhitungan aritmatik, pemanipulasian tanggal dan waktu, pemodifikasian array, string dan objek. Ia juga dapat menangani event yang diinisiasi pengguna, dan menetapkan pewaktu. Kombinasi dari HTMl, CSS, dan JavaScript dapat menghasilkan halaman Web yang terstruktur, bergaya, dan interaktif. Para perancang Web sepakat bahwa ketiganya merupakan bagian penting dari sebuah halaman Web. Topik-topik yang dibahas pada buku ini meliputi: Sejarah JavaScript; Tipe Data; Literal, dan Variabel; Kotak Dialog; Operator; Kondisi; Fungsi; Objek; Objek Inti JavaScript; Objek Browser; Form; Citra dan Link; Penanganan Event; CSS dan JavaScript.",
    "pageCount": 436,
    "stock": 5,
    "publisher": "Sparta Publisher",
    "publishedDate": "2018-12-26",
    "lang": "id",
    "imgUrl": "http://books.google.com/books/content?id=IYxeDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "status": "available",
    "category": "Computers",
    "pricePerWeek": 2528,
    "link": "http://books.google.co.id/books?id=IYxeDwAAQBAJ&printsec=frontcover&dq=javascript&hl=&as_pt=BOOKS&cd=3&source=gbs_api"
  },
  {
    "title": "Semua Bisa Menjadi Programmer JavaScript & Node.js",
    "isbn": "9786230019760",
    "author": "Ir. Yuniar Supardi",
    "synopsis": "JavaScript merupakan program skrip untuk client sehingga penulis juga menyatukan materi Node.js yang merupakan program skrip server untuk JavaScript. Belajar Node.js membuat pengembang dengan bahasa JavaScript dapat membuat skrip web, baik untuk sisi klien dan server. Bahasa Skrip JavaScript menjadi bahasa skrip nomor satu di dunia, apalagi dengan adanya Node.js membuat JavaScript semakin populer, tentu bahasa ini menjadi bahasa pesaing utama Python. Keunggulan buku ini memandu Anda membuat program web menggunakan JavaScript dan Node.js dengan pembahasan yang mudah dan sistematik, sehingga Anda dengan mudah belajar dari buku ini. Dalam buku ini juga Anda dipandu bagaimana membuat program web dengan database MySQL dan SQLite pada Node.js. Topik yang dibahas dalam buku ini mencakup: - Sekilas JavaScript & Node.js - Komponen Program JavaScript - Objek GUI JavaScript - Kejadian (Event) JavaScript - Marquee dan Frame JavaScript - Node.js - NPM Node.js - Modul Node.js - Modul Http - Modul File System - Modul Url - Form Node.js - Upload File Node.js - CRUD MySQL Pada Node.js - SQLite Pada Node.js - dan Lain-lain.",
    "pageCount": 240,
    "stock": 4,
    "publisher": "Elex Media Komputindo",
    "publishedDate": "2021-04-13",
    "lang": "id",
    "imgUrl": "http://books.google.com/books/content?id=CG0qEAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "status": "available",
    "category": "Computers",
    "pricePerWeek": 4009,
    "link": "http://books.google.co.id/books?id=CG0qEAAAQBAJ&printsec=frontcover&dq=javascript&hl=&as_pt=BOOKS&cd=4&source=gbs_api"
  },
  {
    "title": "HTML5 dan Javascript untuk Pemula",
    "isbn": "9786230024320",
    "author": "Jubilee Enterprise",
    "synopsis": "Ilmu membuat website tersedia di dalam HTML5 dan Javascript. Buku ini adalah referensi yang lengkap, to-the point, dan mudah dipahami untuk penggunaan HTML5, Javascript, dan topik lainnya tentang web design, seperti style sheet dan framework Javascript. Tidak memandang apakah Anda awam atau pernah mengenal HTML sebelumnya, buku ini dirancang untuk Anda. Di dalam buku ini, kami akan mengajari cara membangun website memakai HTML5 dan Javascript secara efektif, singkat, tepat, dan jelas! Pembahasan akan dimulai dari cara menginstal editor gratis dari internet. Setelah itu, akan dibahas topik-topik spesifik, seperti struktur HTML, format teks, list dan background, hyperlink, style sheet, image, penulisan Javascript, pembuatan variable, objek angka dan math, bekerja dengan string, operator perbandingan, null dan undefined, konversi tipe data, object, function, dan framework Javascript Vue seperti data binding. Dilengkapi dengan kode-kode program yang jelas, buku ini tidak membutuhkan pengalaman apa pun. Bahkan, Anda bisa mengoperasikannya menggunakan MS Windows. Jadi tunggu apa lagi, ayo belajar cara membuat web design menggunakan HTML5 dan Javascript melalui referensi yang lengkap ini. (thinkjubilee)",
    "pageCount": 304,
    "stock": 5,
    "publisher": "Elex Media Komputindo",
    "publishedDate": "2021-06-11",
    "lang": "id",
    "imgUrl": "http://books.google.com/books/content?id=e14zEAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "status": "available",
    "category": "Computers",
    "pricePerWeek": 3268,
    "link": "http://books.google.co.id/books?id=e14zEAAAQBAJ&printsec=frontcover&dq=javascript&hl=&as_pt=BOOKS&cd=5&source=gbs_api"
  },
  {
    "title": "Javascript untuk pemula",
    "isbn": "-",
    "author": "Jubilee Enterprise",
    "synopsis": "Ilmu membuat website tersedia di dalam HTMLS dan Javascript. Buku ini adalah referensi yang lengkap, to-the point, dan mudah dipahami untuk penggunaan Javascript. Tidak memandang apakah Anda awam atau pernah mengenal Javascript sebelumnya, buku ini dirancang untuk Anda. Di dalam buku ini, kami akan mengajari cara membangun website memakai Javascript secara efektif, singkat, tepat, dan jelas! Pembahasan akan dimulai dari cara menginstal editor gratis dari internet. Setelah itu, akan dibahas topik-topik spesifik, seperti penulisan Javascript, pembuatan variable, objek angka dan math, bekerja dengan string, operator perbandingan, null dan undefined, konversi tipe data, object, function, dan framework Javascript Vue seperti data binding. Dilengkapi dengan kode-kode program yang jelas, buku ini tidak membutuhkan pengalaman apa pun. Bahkan, Anda bisa mengoperasikannya menggunakan MS Windows. Jadi tunggu apa lagi, ayo belajar cara membuat web design menggunakan Javascript melalui referensi yang lengkap ini. (thinkjubilee)",
    "pageCount": 204,
    "stock": 1,
    "publisher": "Elex Media Komputindo",
    "publishedDate": "2021-08-03",
    "lang": "id",
    "imgUrl": "http://books.google.com/books/content?id=VgE9EAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "status": "available",
    "category": "Computers",
    "pricePerWeek": 2080,
    "link": "http://books.google.co.id/books?id=VgE9EAAAQBAJ&printsec=frontcover&dq=javascript&hl=&as_pt=BOOKS&cd=6&source=gbs_api"
  },
  {
    "title": "Buku Sakti HTML, CSS & Javascript",
    "isbn": "9786232443723",
    "author": "Adam Saputra, S.Si.",
    "synopsis": "Memasuki zaman 4.0, kini penguasaan teknologi informasi sudah barang tentu menjadi titik tolok yang paling diperhitungkan sebagai sebuah komoditas untuk melenggang ke arena professional. Industri kreatif semakin digandrungi mengungguli lini-lini konvensional yang sudah mulai harus memperbarui sistem mereka karena imbas kemajuan industri saat ini. Semakin banyaknya minat ke industri kreatif menjadikan semakin banyak pula kemampuan-kemampuan kreatif yang harus dikuasai, dan salah satunya adalah web programming. Walaupun hari ini jasa pembuatan website sudah semakin gampang dan mudah diakses,namun apa salahnya kita semua mempelajari segala hal yang paling fundamental dari konstruksi rumah maya di dunia seberang kita, yakni internet dengan segala gelagasi jaring laba-labanya. Buku ini memuat cara-cara yang paling mudah dalam mempelajari bahasa pemrograman front-end seperti HTML, CSS, dan JavaScript.",
    "pageCount": 268,
    "stock": 2,
    "publisher": "Anak Hebat Indonesia",
    "publishedDate": "2019-08-01",
    "lang": "id",
    "imgUrl": "http://books.google.com/books/content?id=5srzDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "status": "available",
    "category": "Computers",
    "pricePerWeek": 1463,
    "link": "http://books.google.co.id/books?id=5srzDwAAQBAJ&printsec=frontcover&dq=javascript&hl=&as_pt=BOOKS&cd=7&source=gbs_api"
  },
  {
    "title": "Seri Pemrograman Internet : Panduan Pemrograman JavaScript (sampai dengan JavaScript 1.2)",
    "isbn": "979533462X",
    "author": "Antony Pranata",
    "pageCount": 336,
    "stock": 1,
    "publisher": "Penerbit Andi",
    "lang": "id",
    "imgUrl": "http://books.google.com/books/content?id=v9H5RV_paEIC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "status": "available",
    "category": "-",
    "pricePerWeek": 4238,
    "link": "http://books.google.co.id/books?id=v9H5RV_paEIC&pg=PA138&dq=javascript&hl=&as_pt=BOOKS&cd=8&source=gbs_api"
  },
  {
    "title": "Pemrograman Javascript: Teori Dan Implementasi",
    "isbn": "9786028758994",
    "author": "Rismon Hasiholan Sianipar",
    "synopsis": "JavaScript sangat populer! Hampir pada semua komputer terpasang JavaScript di dalam browser Microsoft Internet Explorer, Mozilla Firefox, Google Chrome, Opera, dan lainnya. JavaScript juga merupakan bahasa skript populer yang memiliki banyak nama samaran lain, seperti Mocha, LiveScript, Jscript, dan ECMAScript. JavaScript merupakan bahasa skript populer yang dipakai untuk menciptakan halaman Web yang dapat berinteraksi dengan pengguna dan dapat merespon event yang terjadi pada halaman. JavaScript merupakan perekat yang menyatukan halaman-halaman Web. Akan sangat susah menjumpai halaman Web komersial yang tidak memuat kode JavaScript. Ada banyak buku yang didedikasikan untuk membahas beberapa aspek dari bahasa JavaScript dan jika Anda masih “baru” dengan bahasa ini, akan sangat sulit untuk mengetahui di mana harus memulainya. Buku ini merupakan buku “untuk semua kalangan”, yang didedikasikan untuk mereka yang menginginkan keseimbangan antara sisi teknis bahasa dan elemen-elemen menyenangkan, sebuah buku yang mendiskusikan permasalahan-permasalahan lintas-platform, dan sebuah buku yang tidak mengharuskan Anda seorang guru sebelum Anda memulainya. Buku ini menjelaskan bagaimana bahasa ini diterapkan dimulai dari contoh-contoh yang paling mendasar sampai yang lebih kompleks, dengan progres yang memandu Anda contoh demi contoh sampai Anda menguasainya. Karena saya seorang guru, saya merasa kebutuhan akan contoh-contoh yang baik diperlukan untuk mendapatkan hasil yang baik. Saya telah banyak belajar dan berharap bahwa Anda menikmati buku bahasa pemrograman Web ini dengan cara yang menyenangkan. Berikut merupakan topik-topik yang dibahas pada buku ini: Bab 1. Sejarah JavaScript Bab 2. Tipe Data, Literal, dan Variabel Bab 3. Kotak Dialog Bab 4. Operator Bab 5. Kondisi Bab 6. Fungsi Bab 7. Objek Bab 8. Objek Inti JavaScript Bab 9. Objek Browser Bab 10. Form Bab 11. Citra dan Link Bab 12. Penanganan Event Bab 13. CSS dan JavaScript",
    "pageCount": 440,
    "stock": 3,
    "publisher": "Penerbit INFORMATIKA",
    "publishedDate": "2015-05-28",
    "lang": "id",
    "imgUrl": "http://books.google.com/books/content?id=8QZ2DwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "status": "available",
    "category": "-",
    "pricePerWeek": 1928,
    "link": "http://books.google.co.id/books?id=8QZ2DwAAQBAJ&printsec=frontcover&dq=javascript&hl=&as_pt=BOOKS&cd=9&source=gbs_api"
  },
  {
    "title": "Javascript guempil",
    "isbn": "-",
    "author": "malik kurosaki",
    "synopsis": "javascript itu mudah , mungkin akan ada pertanyaan bagaimana kok mudah ..? wong lihat tulisannya aja uda bikin cidera otak . Itu juga yang saya pikirkan waktu pertama kali ingin mempelajari javascript , sebelumnya sudah mempelajari html dan css, beda sekali jika dibandingkan dengan html atau css pada dasarnya html lebih kepada tata letaak dan pada fungsi tagnya sedangkan css memberi keindahan dan warna agar terlihat lebih hidup. Ibarat sebuah pohon html adalah dahan batang dan ranting yang mengatur dimana bunga atau buah atau daun ditempatkan sedangkan css mmberikan warna bentuk daun bentuk bunga pada pohon tersebut maka dari situ bisalah tercipta sebuah gambaran pohon yang hidup. Penulisan sebuah program pada web bisa dikatakan seni jika kita melihatnya dalam bingkai seni ,karena tak jarang kita cendrung senang jika melihat sebuah eb tertata dengan rapi dan cantik, disitulah dibutuhkan keterampilan tangan dan seni untuk menciptakan sebuah web yang indah.",
    "pageCount": 20,
    "stock": 2,
    "publisher": "blackangel media",
    "publishedDate": "2018-05-15",
    "lang": "id",
    "imgUrl": "http://books.google.com/books/content?id=E_JaDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "status": "available",
    "category": "Computers",
    "pricePerWeek": 2367,
    "link": "http://books.google.co.id/books?id=E_JaDwAAQBAJ&printsec=frontcover&dq=javascript&hl=&as_pt=BOOKS&cd=10&source=gbs_api"
  },
  {
    "title": "7 Materi Pemrograman Web untuk Pemula 3: JavaScript & MariaDB",
    "isbn": "-",
    "author": "Rohi Abdulloh",
    "synopsis": "Teknologi pemrograman web terus berkembang begitu cepat. Para pemula tentu akan semakin tertinggal jika tidak cepat mengejar. Buku ini membahas 7 materi pemrograman web sekaligus yang menjadi materi utama dalam mempelajari pemrograman web. Materi yang diberikan akan sangat membantu para pemula yang ingin menguasai pemrograman web dan menjadi web programmer dalam waktu singkat. Pembahasan dimulai dari pengetahuan dasar tentang pemrograman web, dilanjutkan dengan pembahasan 7 materi pemrograman web, satu demi satu disertai dengan contoh skrip beserta hasilnya. Disertai juga pembuatan aplikasi sederhana yang akan membantu pembaca menguasai pembuatan modul aplikasi. Untuk menunjang latihan, penulis juga menyertakan puluhan bonus skrip aplikatif. Dengan menguasai buku ini, pembaca dapat menjadi web programmer yang siap dan mampu membuat aplikasi web secara mandiri. Pembahasan selengkapnya mencakup: • Dasar web programming • HTML • CSS • MariaDB • PHP • Javascript • Bootstrap • Laravel",
    "pageCount": 175,
    "stock": 5,
    "publisher": "PT Elex Media Komputindo",
    "publishedDate": "2022-07-29",
    "lang": "id",
    "imgUrl": "http://books.google.com/books/content?id=NYl-EAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "status": "available",
    "category": "Computers",
    "pricePerWeek": 1492,
    "link": "http://books.google.co.id/books?id=NYl-EAAAQBAJ&printsec=frontcover&dq=javascript&hl=&as_pt=BOOKS&cd=11&source=gbs_api"
  },
  {
    "title": "JavaScript by Example",
    "isbn": "0131401629",
    "author": "Ellie Quigley",
    "synopsis": "This is the definitive JavaScript tutorial for the serious nonprogrammer who is interested in mastering the full power of the language. Includes hundreds of example JavaScript programs that demonstrate both the fun and practical aspects.",
    "pageCount": 756,
    "stock": 3,
    "publisher": "Prentice Hall Professional",
    "publishedDate": "2004",
    "lang": "en",
    "imgUrl": "http://books.google.com/books/content?id=IAJv2N1n9JAC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "status": "available",
    "category": "Computers",
    "pricePerWeek": 1870,
    "link": "http://books.google.co.id/books?id=IAJv2N1n9JAC&printsec=frontcover&dq=javascript&hl=&as_pt=BOOKS&cd=12&source=gbs_api"
  },
  {
    "title": "Pemrograman Web Berbasis HTML 5, PHP, Dan JavaScript",
    "isbn": "9786020243627",
    "author": "Edy Winarno ST, M.Eng, Ali Zaki & SmitDev Community",
    "synopsis": "Buku ini menjelaskan cara melakukan pemrograman web dengan mudah memakai 3 bahasa pemrograman pokok, yaitu HTML5, PHP, dan JavaScript. Anda akan belajar bagaimana memanfaatkan HTML5 sebagai antarmuka awal, selanjutnya mengenal PHP untuk memberikan kemampuan pengolahan data client-server di web, lalu menggunakan JavaScript untuk memberikan sentuhan dinamis. Setiap penjelasan dilengkapi dengan contoh program dan di bagian akhir ditutup dengan pembuatan program yang melibatkan ketiganya. *Bonus pada buku fisik (CD, voucher, pembatas buku) tidak disertakan dalam buku digital (e-book)",
    "pageCount": 248,
    "stock": 2,
    "publisher": "Elex Media Komputindo",
    "publishedDate": "2014-06-23",
    "lang": "id",
    "imgUrl": "http://books.google.com/books/content?id=YuVyDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "status": "available",
    "category": "Education",
    "pricePerWeek": 2543,
    "link": "http://books.google.co.id/books?id=YuVyDwAAQBAJ&printsec=frontcover&dq=javascript&hl=&as_pt=BOOKS&cd=13&source=gbs_api"
  },
  {
    "title": "Grafika Dalam JavaScript",
    "isbn": "-",
    "author": "Vivian Siahaan, Rismon Hasiholan Sianipar",
    "synopsis": "Selamat datang ke dunia grafika! Jika Anda memegang buku di tangan Anda, berarti Anda tertarik dengan visualisasi data, sembari berharap dapat mengembangkan halaman web dengan grafik-grafik yang interaktif. Atau, mungkin tujuan Anda adalah memperbarui pengetahuan Anda tentang pustaka jqPlot, D3, atau Highcharts. Apapun harapan Anda, diharapkan buku ini membantu Anda untuk mencapainya. Ketika Anda menyajikan data untuk menunjukkan relasi atau untuk mencari perbandingan atau untuk menyoroti tren, Anda membuat grafik. Grafik merupakan sebuah struktur yang memuat simbol, seperti garis, batang, irisan, dan lainnya. Grafik berperan sebagai perangkat yang dapat membantu Anda mencerna dan memahami relasi pada data. Selain beragam grafika dan pustaka JavaScript, buku ini merangkum sejumlah topik: pustaka jQuery, HTML5, dan kanvas, widget dan kontrol, manipulasi grafika dengan teknologi SVG (scalable vector graphics), dan lainnya. Buku ini kaya akan beragam topik dengan banyak contoh, masing-masing diberikan secara bertahap, sehingga diharapkan Anda hanya fokus pada bagian-bagian kode yang diterapkan. Pengembangan grafik menjadi mudah begitu Anda mengetahui prosesnya dan memiliki perangkat yang tepat. Oleh karena itu, buku ini menyajikan kode-kode utuh yang bisa Anda manipulasi sesuai dengan kebutuhan visualisasi data Anda. Berikut merupakan topik-topik yang dibahas pada buku ini: Bab 1. Tabel HTML Sederhana Bab 2. Menggambar Kurva Garis Bab 3. Menggambar Grafik Batang Bab 4. Menggambar Grafik Pie Bab 5. Mengenalkan jqPlot Bab 6. Grafik Garis dengan jqPlot Bab 7. Grafik Batang dengan jqPlot Bab 8. Grafik Pie dan Donut dengan jqPlot Bab 9. Grafik Candlestick, Scatter, Bubble, dan Funnel dengan jqPlot Bab 10. Kontrol dan Widget Bab 11. Grafik dengan Highcharts Bab 12. Grafik Garis dengan D3 Bab 13. Grafik Batang dan Pie dengan D3 Bab 14. Grafik Lainnya dengan D3",
    "pageCount": 387,
    "stock": 1,
    "publisher": "BALIGE PUBLISHING",
    "publishedDate": "2018-10-02",
    "lang": "id",
    "imgUrl": "http://books.google.com/books/content?id=-oFeDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "status": "available",
    "category": "Computers",
    "pricePerWeek": 4476,
    "link": "http://books.google.co.id/books?id=-oFeDwAAQBAJ&printsec=frontcover&dq=javascript&hl=&as_pt=BOOKS&cd=14&source=gbs_api"
  },
  {
    "title": "Dasar CSS dan JavaScript",
    "isbn": "-",
    "author": "Vivian Siahaan, Rismon Hasiholan Sianipar",
    "synopsis": "Pada buku ini, Anda akan dikenalkan tentang XHTML (Extensible Hypertext Markup Language) yang dapat dipakai untuk membungkus informasi sehingga dapat diinterpretasi oleh penjelajah web. Pada awal buku ini, Anda akan fokus mempelajari pemformatan dan penyajian informasi. Untuk melakukannya, Anda akan menggunakan sebuah teknologi W3C yang dinamakan dengan CSS (Cascading Style Sheets) yang memampukan pembuat dokumen untuk menetapkan presentasi elemen-elemen sebuah halaman web (misalnya, jenis huruf (font), pengaturan spasi, warna, dll) yang terpisah dari struktur dokumen (bagian kepala, teks tubuh, link, dan lainnya). Pemisahan struktur dokumen dari presentasi elemen akan menyederhanakan pemodifikasian sebuah halaman web. Selanjutnya Anda akan menuliskan sebuah skrip JavaScript. Adalah hal yang penting untuk memahami jenis blok pembangun yang tersedia dan untuk menggunakan prinsip-prinsi konstruksi program yang teruji. Pada buku ini, Anda akan mempelajari konstruksi seleksi, repetisi, array, dan objek dalam JavaScript. Selanjutnya, pada Anda akan dikenalkan mengenai DOM (Document Object Model). DOM memberikan Anda akses terhadap semua elemen pada suatu halaman web. Di dalam penjelajah web, formulir paragraf, tabel, dan lainnya, direpresentasikan pada sebuah hierarki objek. Dengan menggunakan JavaScript, Anda dapat menciptakan, memodifikasi, dan menghilangkan elemen-elemen di dalam halaman web secara dinamis. Setiap penjelajah internet (Web Browser) memiliki versi HTML dinamis (DHTML) yang berbeda, yang masing-masing menyediakan fungsionalitas yang sama. Namun, meskipun masing-masing memiliki kapabilitas yang sama, setiap model tersebut tidak kompatibel satu sama lain. Dalam usaha meningkatkan kompatibilitas lintas-penjelajah, W3C memberlakukan DOM terstandarisasi. Firefox, IE7, dan banyak penjelajah web lainnya mengimplementasikan hampir semua fitur DOM dari W3C. Pada buku ini, akan didiskusikan mengenai filter dan transisi. Penerapan filter terhadap teks dan citra menyebabkan perubahan yang persisten. Transisi bersifat temporer; penerapan sebuah transisi memampukan Anda untuk mengalihkan dari satu halaman ke halaman lain dengan efek visual seperti random dissolve. Filter dan transisi tidak menambahkan konten pada halaman Anda, tetapi keduanya dapat dipakai untuk menangkap atensi pengguna. Setiap efek visual yang diterapkan dengan filter dan transisi dapat diprogram (programabel), sehingga efek tersebut dapat diubah secara dinamis oleh program untuk merespon event yang dilakukan pengguna, seperti klik mouse dan penekanan-kunci. Filter dan transisi sangat mudah digunakan sehingga para perancang halaman web dapat menggunakannya dengan usaha yang minimal. Bagian dari keindahan filter dan transisi DHTML (dynamic HTML) adalah bahwa keduanya merupakan paket yang terintegrasi di dalam Internet Explorer. Anda tidak lagi memerlukan program paket grafis untuk memanfaatkannya. Filter dan transisi ditetapkan dengan properti filter dari CSS. Kapabilitas ini serupa dengan kapabilitas grafis dari perangkat lunak semacam PowerPoint dari Microsoft. Anda dapat memiliki halaman baru atau potong halaman web yang memudar. Anda dapat memiliki sebuah halaman yang secara acak menjelma (randomly dissolve) menjadi halaman berikutnya. Anda dapat membuat potongan halaman menjadi transparan atau semitransparan sehingga Anda dapat melihat apa yang ada di baliknya. Anda dapat mengaburkan teks atau citra untuk memberikannya ilusi gerakan. Anda dapat menciptakan bayangan pada elemen untuk memberikannya efek tiga-dimensi. Anda bahkan dapat menggabungkan beberapa efek untuk menghasilkan pelbagai efek yang lebih besar.",
    "pageCount": 238,
    "stock": 4,
    "publisher": "Sparta Publisher",
    "publishedDate": "2018-11-07",
    "lang": "id",
    "imgUrl": "http://books.google.com/books/content?id=m4heDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "status": "available",
    "category": "Computers",
    "pricePerWeek": 1463,
    "link": "http://books.google.co.id/books?id=m4heDwAAQBAJ&printsec=frontcover&dq=javascript&hl=&as_pt=BOOKS&cd=15&source=gbs_api"
  },
  {
    "title": "Decoding JavaScript",
    "isbn": "9789390684816",
    "author": "Rushabh Mulraj Shah",
    "synopsis": "Mastering advanced JavaScript to build modern next-generation web applications. Ê KEY FEATURESÊÊ _ A simplified explanation of complex concepts to create powerful and flexible web applications. _ Learn testing JavaScript code, regular expressions, fetching data, and many more with ES6. _ A full-fledged section dedicated to developing an application using JavaScript. DESCRIPTIONÊ Decoding JavaScript will take the users on an eventful journey of simplifying and understanding advanced concepts of JavaScript. Since JavaScript is the core programming language for almost every interaction on the web, this book will make it easier for readers to develop modern cutting-edge web applications. Ê The book begins with a quick recap of the fundamental JavaScript (JS) concepts like the syntax of JS, data types, operators, conditionals, looping, functions, arrays, objects, and so on. The readers will also explore the handy Chrome DevelopersÕ Tools.ÊÊ This book will also help readers learn and implement important concepts like how to connect to the servers, fetching data like images, user information, videos, etc. from the server, and displaying it on the web page. Besides that, users will learn about impactful concepts like testing JavaScript code, regular expressions, and exploring the popular ES6 and the versions beyond. Most importantly, this book will help you with the best JavaScript practices followed by companies like Google, Facebook, Twitter, etc. to develop a live application right from scratch. WHAT YOU WILL LEARN _ Build dynamic web applications interacting with servers using Vanilla. _ Improve code efficiency by learning advanced concepts of JavaScript. _ Get acquainted with best practices adopted by industry leaders, including Google and Facebook.Ê _ Get access to work with popular libraries like ReactJS, jQuery, Angular, Ember, and Vue. WHO THIS BOOK IS FORÊÊ This book is for aspiring web developers and fairly experienced JavaScript developers who want to create modern web and server applications. Prior knowledge of HTML and CSS is essential to begin with this book. TABLE OF CONTENTS 1. Introduction to JavaScript 2. The DeveloperÕs Tools 3. Functions 4. Arrays 5. Objects 6. ES6 7. Classes 8. Callbacks and Promises 9. AJAX and Interacting with Servers 10. Developing a Live Application! 11. Storing Data in Browsers 12. Debugging and Error Handling 13. Testing and Test Frameworks 14. Regular Expressions 15. Life after ES6 16. Tips and Tricks",
    "pageCount": 404,
    "stock": 1,
    "publisher": "BPB Publications",
    "publishedDate": "2021-05-21",
    "lang": "en",
    "imgUrl": "http://books.google.com/books/content?id=8novEAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "status": "available",
    "category": "Computers",
    "pricePerWeek": 4119,
    "link": "http://books.google.co.id/books?id=8novEAAAQBAJ&printsec=frontcover&dq=javascript&hl=&as_pt=BOOKS&cd=16&source=gbs_api"
  },
  {
    "title": "JavaScript: The Definitive Guide",
    "isbn": "9780596554477",
    "author": "David Flanagan",
    "synopsis": "This Fifth Edition is completely revised and expanded to cover JavaScript as it is used in today's Web 2.0 applications. This book is both an example-driven programmer's guide and a keep-on-your-desk reference, with new chapters that explain everything you need to know to get the most out of JavaScript, including: Scripted HTTP and Ajax XML processing Client-side graphics using the canvas tag Namespaces in JavaScript--essential when writing complex programs Classes, closures, persistence, Flash, and JavaScript embedded in Java applications Part I explains the core JavaScript language in detail. If you are new to JavaScript, it will teach you the language. If you are already a JavaScript programmer, Part I will sharpen your skills and deepen your understanding of the language. Part II explains the scripting environment provided by web browsers, with a focus on DOM scripting with unobtrusive JavaScript. The broad and deep coverage of client-side JavaScript is illustrated with many sophisticated examples that demonstrate how to: Generate a table of contents for an HTML document Display DHTML animations Automate form validation Draw dynamic pie charts Make HTML elements draggable Define keyboard shortcuts for web applications Create Ajax-enabled tool tips Use XPath and XSLT on XML documents loaded with Ajax And much more Part III is a complete reference for core JavaScript. It documents every class, object, constructor, method, function, property, and constant defined by JavaScript 1.5 and ECMAScript Version 3. Part IV is a reference for client-side JavaScript, covering legacy web browser APIs, the standard Level 2 DOM API, and emerging standards such as the XMLHttpRequest object and the canvas tag. More than 300,000 JavaScript programmers around the world have madethis their indispensable reference book for building JavaScript applications. \"A must-have reference for expert JavaScript programmers...well-organized and detailed.\" -- Brendan Eich, creator of JavaScript",
    "pageCount": 1022,
    "stock": 3,
    "publisher": "\"O'Reilly Media, Inc.\"",
    "publishedDate": "2006-08-17",
    "lang": "en",
    "imgUrl": "http://books.google.com/books/content?id=2weL0iAfrEMC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "status": "available",
    "category": "Computers",
    "pricePerWeek": 4993,
    "link": "http://books.google.co.id/books?id=2weL0iAfrEMC&printsec=frontcover&dq=javascript&hl=&as_pt=BOOKS&cd=17&source=gbs_api"
  },
  {
    "title": "JavaScript Unlocked",
    "isbn": "9781785885068",
    "author": "Dmitry Sheiko",
    "synopsis": "Improve your code maintainability, performance, and security through practical expert insights and unlock the full potential of JavaScript About This Book Improve your JavaScript code for better maintainability and performance Discover how to implement scalable application architecture with JavaScript Learn to use JavaScript behind the browser, including its command-line tools, desktop apps, and native mobile apps Who This Book Is For JavaScript Unlocked is for those JS developers who want to see just how far they can push their favourite language through practical insight and techniques. What You Will Learn Make your code readable and expressive by using simple syntax of JavaScript Grasp existing JavaScript collections such as arrays and array-like objects Develop abstract data types in most effective way to extend JavaScript into a more flexible and powerful programming language Examine the pros and cons of JavaScript by implementing real-time code examples Flourish real-time mini-projects by using JavaScript on server side to develop desktop as well as mobile applications Work on parallel tasks with asynchronous JavaScript Improve code maintainability and readability and boost apps performance through JavaScript In Detail JavaScript stands bestride the world like a colossus. Having conquered web development, it now advances into new areas such as server scripting, desktop and mobile development, game scripting, and more. One of the most essential languages for any modern developer, the fully-engaged JavaScript programmer need to know the tricks, non-documented features, quirks, and best practices of this powerful, adaptive language. This all-practical guide is stuffed with code recipes and keys to help you unlock the full potential of JavaScript. Start by diving right into the core of JavaScript, with power user techniques for getting better maintainability and performance from the basic building blocks of your code. Get to grips with modular programming to bring real power to the browser, master client-side JavaScript scripting without jQuery or other frameworks, and discover the full potential of asynchronous coding. Do great things with HTML5 APIs, including building your first web component, tackle the essential requirements of writing large-scale applications, and optimize JavaScript's performance behind the browser. Wrap up with in-depth advice and best practice for debugging and keeping your JavaScript maintainable for scaling, long-term projects. With every task demonstrated in both classic ES5 JavaScript and next generation ES6-7 versions of the language, Whether read cover-to-cover or dipped into for specific keys and recipes, JavaScript Unlocked is your essential guide for pushing JavaScript to its limits. Style and approach This practice-oriented cookbook is packed full of code examples put in the form: problem, classical solution, and methods to optimize webpage in both JavaScript ES5 and ES6 language editions. But this thorough guide is best-suited to those who like to “learn by doing” as the topics are covered using real-life examples and tutorials.",
    "pageCount": 182,
    "stock": 1,
    "publisher": "Packt Publishing Ltd",
    "publishedDate": "2015-12-07",
    "lang": "en",
    "imgUrl": "http://books.google.com/books/content?id=CDzlCwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "status": "available",
    "category": "Computers",
    "pricePerWeek": 1818,
    "link": "http://books.google.co.id/books?id=CDzlCwAAQBAJ&printsec=frontcover&dq=javascript&hl=&as_pt=BOOKS&cd=18&source=gbs_api"
  },
  {
    "title": "JavaScript by Example",
    "isbn": "9781788299008",
    "author": "Dani Akash S",
    "synopsis": "A project based guide to help you get started with web development by building real-world and modern web applications About This Book Learn JavaScript from scratch by building clones of popular web applications Understand the core concepts and techniques surrounding JavaScript with this power-packed hands-on guide Explore modern JavaScript frameworks and libraries such as Node, React and Webpack Who This Book Is For The target audience for this book is developers with little or basic knowledge of working with JavaScript. If you are an emerging web developer with experience in building static web pages using HTML and CSS, this book will teach you to add JavaScript elements to make your website interactive and dynamic. What You Will Learn A strong understanding of web application development with JavaScript and ES6. A firm foundation on which to master other JavaScript frameworks and libraries. Write maintainable and scalable code by organizing functions into modules. Importance of tools such as Node, NPM, Babel, and Webpack in Front-end development. Work with real-time data such as incoming video streams, texts, and so on Integrate React with JavaScript to build large-scale applications. Utilize Redux to manage data across React components and greatly speed up the development process In Detail JavaScript is the programming language that all web developers need to learn. The first item on our JavaScript to-do list is building g a To-do list app, which you'll have done by the end of the first chapter. You'll explore DOM manipulation with JavaScript and work with event listeners. You'll work with images and text to build a Meme creator. You will also learn about ES (ECMAScript) classes, and will be introduced to layouts using the CSS3 Flexbox. You'll also develop a responsive Event Registration form that allows users to register for your upcoming event and use charts and graphics to display registration data. You will then build a weather application, which will show you different ways perform AJAX requests and work with dynamic, external data. WebRTC enables real-time communication in a web browser; you'll learn how to use it when you build a real-time video-call and chat application later in the book. Towards the end of the book, you will meet React, Facebook's JavaScript library for building user interfaces. You'll throw together a blog with React, and get a feel for why this kind of JavaScript framework is used to build large-scale applications. To make your blog more maintainable and scalable, you'll use Redux to manage data across React components. Style and approach This project-based guide will teach you all the facets of JavaScript through real-world app examples.",
    "pageCount": 289,
    "stock": 4,
    "publisher": "Packt Publishing Ltd",
    "publishedDate": "2017-08-30",
    "lang": "en",
    "imgUrl": "http://books.google.com/books/content?id=WJZGDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "status": "available",
    "category": "Computers",
    "pricePerWeek": 1295,
    "link": "http://books.google.co.id/books?id=WJZGDwAAQBAJ&printsec=frontcover&dq=javascript&hl=&as_pt=BOOKS&cd=19&source=gbs_api"
  },
  {
    "title": "Clean Code in JavaScript",
    "isbn": "9781789957297",
    "author": "James Padolsey",
    "synopsis": "Get the most out of JavaScript for building web applications through a series of patterns, techniques, and case studies for clean coding Key FeaturesWrite maintainable JS code using internal abstraction, well-written tests, and well-documented codeUnderstand the agents of clean coding like SOLID principles, OOP, and functional programmingExplore solutions to tackle common JavaScript challenges in building UIs, managing APIs, and writing statesBook Description Building robust apps starts with creating clean code. In this book, you’ll explore techniques for doing this by learning everything from the basics of JavaScript through to the practices of clean code. You’ll write functional, intuitive, and maintainable code while also understanding how your code affects the end user and the wider community. The book starts with popular clean-coding principles such as SOLID, and the Law of Demeter (LoD), along with highlighting the enemies of writing clean code such as cargo culting and over-management. You’ll then delve into JavaScript, understanding the more complex aspects of the language. Next, you’ll create meaningful abstractions using design patterns, such as the Class Pattern and the Revealing Module Pattern. You’ll explore real-world challenges such as DOM reconciliation, state management, dependency management, and security, both within browser and server environments. Later, you’ll cover tooling and testing methodologies and the importance of documenting code. Finally, the book will focus on advocacy and good communication for improving code cleanliness within teams or workplaces, along with covering a case study for clean coding. By the end of this book, you’ll be well-versed with JavaScript and have learned how to create clean abstractions, test them, and communicate about them via documentation. What you will learnUnderstand the true purpose of code and the problems it solves for your end-users and colleaguesDiscover the tenets and enemies of clean code considering the effects of cultural and syntactic conventionsUse modern JavaScript syntax and design patterns to craft intuitive abstractionsMaintain code quality within your team via wise adoption of tooling and advocating best practicesLearn the modern ecosystem of JavaScript and its challenges like DOM reconciliation and state managementExpress the behavior of your code both within tests and via various forms of documentationWho this book is for This book is for anyone who writes JavaScript, professionally or otherwise. As this book does not relate specifically to any particular framework or environment, no prior experience of any JavaScript web framework is required. Some knowledge of programming is assumed to understand the concepts covered in the book more effectively.",
    "pageCount": 527,
    "stock": 3,
    "publisher": "Packt Publishing Ltd",
    "publishedDate": "2020-01-20",
    "lang": "en",
    "imgUrl": "http://books.google.com/books/content?id=DprLDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "status": "available",
    "category": "Computers",
    "pricePerWeek": 4179,
    "link": "http://books.google.co.id/books?id=DprLDwAAQBAJ&printsec=frontcover&dq=javascript&hl=&as_pt=BOOKS&cd=20&source=gbs_api"
  },
  {
    "title": "Hands-On Design Patterns with React Native",
    "isbn": "9781788999540",
    "author": "Mateusz Grzesiukiewicz",
    "synopsis": "Learn how to write cross platform React Native code by using effective design patterns in the JavaScript world. Get to know industry standard patterns as well as situational patterns. Decouple your application with these set of “Idea patterns”. Key FeaturesMobile development in React Native should be done in a reusable way. Learn how to build scalable applications using JavaScript patterns that are battle tested.Try effective techniques on your own using over 80 standalone examples.Book Description React Native helps developers reuse code across different mobile platforms like iOS and Android. This book will show you effective design patterns in the React Native world and will make you ready for professional development in big teams. The book will focus only on the patterns that are relevant to JavaScript, ECMAScript, React and React Native. However, you can successfully transfer a lot of the skills and techniques to other languages. I call them “Idea patterns”. This book will start with the most standard development patterns in React like component building patterns, styling patterns in React Native and then extend these patterns to your mobile application using real world practical examples. Each chapter comes with full, separate source code of applications that you can build and run on your phone. The book is also diving into architectural patterns. Especially how to adapt MVC to React environment. You will learn Flux architecture and how Redux is implementing it. Each approach will be presented with its pros and cons. You will learn how to work with external data sources using libraries like Redux thunk and Redux Saga. The end goal is the ability to recognize the best solution for a given problem for your next mobile application. What you will learnExplore the design Patterns in React NativeLearn the best practices for React Native developmentExplore common React patterns that are highly used within React Native developmentLearn to decouple components and use dependency injection in your applicationsExplore the best ways of fetching data from the backend systemsLearn the styling patterns and how to implement custom mobile designsExplore the best ways to organize your application code in big codebasesWho this book is for The ideal target audience for this book are people eager to learn React Native design patterns who already know the basics of JavaScript. We can assume that the target audience already knows how to write Hello World in JavaScript and know what are the functions, recursive functions, JavaScript types and loops.",
    "pageCount": 297,
    "stock": 5,
    "publisher": "Packt Publishing Ltd",
    "publishedDate": "2018-09-29",
    "lang": "en",
    "imgUrl": "http://books.google.com/books/content?id=Iv1wDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "status": "available",
    "category": "Computers",
    "pricePerWeek": 651,
    "link": "http://books.google.co.id/books?id=Iv1wDwAAQBAJ&printsec=frontcover&dq=react&hl=&as_pt=BOOKS&cd=1&source=gbs_api"
  },
  {
    "title": "Menguasai React JS Untuk Pemula",
    "isbn": "-",
    "author": "Rohi Abdulloh",
    "synopsis": "Buku ini ditujukan bagi siapa saja yang ingin menguasai React. Pembahasan dimulai teori dasar JavaScript, sehingga buku ini dapat diikuti oleh orang yang baru mengenal JavaScript sekalipun. Buku ini dibuat dengan skrip berwarna, harapannya akan lebih mudah diikuti dan dipahami. Setiap pembahasan disertai contoh skrip dan hasilnya. File-file latihan pada buku ini diminta melalui email penulis dengan menyertakan bukti pembelian buku. Total halaman buku ini sampai 400 lebih halaman. Materi yang dibahas meliputi: - Teori dasar JavaScript - Teori dasr React - Menggunakan Component Library - Menggunakan Material UI - Menerapkan Routing dan AJAX - Integrasi dengan Laravel dan Inertia Buku ini ditulis oleh penulis yang sudah berpengalaman menulis buku-buku best seller. Bahkan buku-bukunya banyak yang dikoleksi oleh pembaca. Salah satu keunggulan dari buku-bukunya yaitu mudah diikuti oleh pemula sekalipun.",
    "pageCount": 407,
    "stock": 3,
    "publisher": "Rohi Abdulloh",
    "publishedDate": "2020-11-25",
    "lang": "id",
    "imgUrl": "http://books.google.com/books/content?id=jq4LEAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "status": "available",
    "category": "Young Adult Nonfiction",
    "pricePerWeek": 1743,
    "link": "http://books.google.co.id/books?id=jq4LEAAAQBAJ&printsec=frontcover&dq=react&hl=&as_pt=BOOKS&cd=2&source=gbs_api"
  },
  {
    "title": "React Projects",
    "isbn": "9781789953398",
    "author": "Roy Derks",
    "synopsis": "Build cross-platform applications of varying complexity for the web, mobile, and VR devices using React tooling Key FeaturesBuild React applications at scale using effective React patterns and best practicesExplore React features such as Hooks, the Context API, and the Suspense APIExtend React’s integration with React Native for building cross-platform mobile apps and gamesBook Description Developed by Facebook, React is a popular library for building impressive user interfaces. React extends its capabilities to the mobile platform using the React Native framework and integrates with popular web and mobile tools to build scalable applications. React Projects is your guide to learning React development by using modern development patterns and integrating React with powerful web tools such as GraphQL, Expo, and React 360. You'll start building a real-world project right from the first chapter and get hands on with developing scalable applications as you advance to building more complex projects. Throughout the book, you'll use the latest versions of React and React Native to explore features such as Higher Order Components (HOC), Context, and Hooks on multiple platforms, which will help you build full stack web and mobile applications efficiently. Finally, you'll delve into unit testing with Jest to build test-driven apps. By the end of this React book, you'll have developed the skills necessary to start building scalable React apps across web and mobile platforms. What you will learnCreate a wide range of applications using various modern React tools and frameworksDiscover how React Hooks modernize state management for React appsDevelop progressive web applications using React componentsBuild test-driven React applications using the Jest and Enzyme frameworksUnderstand full stack development using React, Apollo, and GraphQLPerform server-side rendering using React and React RouterDesign gestures and animations for a cross-platform game using React NativeWho this book is for The book is for JavaScript developers who want to explore React tooling and frameworks for building cross-platform applications. Basic knowledge of web development, ECMAScript, and React will assist with understanding key concepts covered in this book.",
    "pageCount": 465,
    "stock": 3,
    "publisher": "Packt Publishing Ltd",
    "publishedDate": "2019-12-20",
    "lang": "en",
    "imgUrl": "http://books.google.com/books/content?id=2HvGDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "status": "available",
    "category": "Computers",
    "pricePerWeek": 266,
    "link": "http://books.google.co.id/books?id=2HvGDwAAQBAJ&printsec=frontcover&dq=react&hl=&as_pt=BOOKS&cd=3&source=gbs_api"
  },
  {
    "title": "Learning React Native",
    "isbn": "9781491989098",
    "author": "Bonnie Eisenman",
    "synopsis": "Get a practical introduction to React Native, the JavaScript framework for writing and deploying fully featured mobile apps that render natively. The second edition of this hands-on guide shows you how to build applications that target iOS, Android, and other mobile platforms instead of browsers—apps that can access platform features such as the camera, user location, and local storage. Through code examples and step-by-step instructions, web developers and frontend engineers familiar with React will learn how to build and style interfaces, use mobile components, and debug and deploy apps. You’ll learn how to extend React Native using third-party libraries or your own Java and Objective-C libraries. Understand how React Native works under the hood with native UI components Examine how React Native’s mobile-based components compare to basic HTML elements Create and style your own React Native components and applications Take advantage of platform-specific APIs, as well as modules from the framework’s community Incorporate platform-specific components into cross-platform apps Learn common pitfalls of React Native development, and tools for dealing with them Combine a large application’s many screens into a cohesive UX Handle state management in a large app with the Redux library",
    "pageCount": 242,
    "stock": 5,
    "publisher": "\"O'Reilly Media, Inc.\"",
    "publishedDate": "2017-10-23",
    "lang": "en",
    "imgUrl": "http://books.google.com/books/content?id=xAg7DwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "status": "available",
    "category": "Computers",
    "pricePerWeek": 2920,
    "link": "http://books.google.co.id/books?id=xAg7DwAAQBAJ&printsec=frontcover&dq=react&hl=&as_pt=BOOKS&cd=4&source=gbs_api"
  },
  {
    "title": "A simpel basic tutor programming",
    "isbn": "-",
    "author": "-",
    "synopsis": "tutorial buku tentang awal pembuatan project dengan react native",
    "stock": 3,
    "publisher": "Lan Dev",
    "publishedDate": "2017-01-17",
    "lang": "id",
    "imgUrl": "http://books.google.com/books/content?id=kbjPDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "status": "available",
    "category": "Young Adult Nonfiction",
    "pricePerWeek": 4709,
    "link": "http://books.google.co.id/books?id=kbjPDwAAQBAJ&printsec=frontcover&dq=react&hl=&as_pt=BOOKS&cd=5&source=gbs_api"
  },
  {
    "title": "React",
    "isbn": "1976210232",
    "author": "Lionel Lopez",
    "synopsis": "REACT This book/tutorial is about ReactJS and it is designed to move you from beginner to advanced programming. This book is based on 17 chapters well managed and it will helps you to become a React JS expert in less than 7 days. Each chapter will contain a certain number of relevant topics with illustrations and exercises where necessary, this will all be finished off with an end of chapter quiz for an easy and enjoyable learning. Benefits of reading this book that you're not going to find anywhere else: It helps you to understand React Easily. You can learn how to install Node JS based on ReactJS. With React you can build applications fast. ReactJS is SEO friendly. It makes code writing simple. We can use React with other libraries. React JS is very light weight front-end framework which allows developers to create web applications faster. Great Community Support. Supports State Management using Redux. CLICK ADD TO CART TO GET THIS AMAZING BOOK!",
    "pageCount": 206,
    "stock": 4,
    "publisher": "Createspace Independent Publishing Platform",
    "publishedDate": "2017-09-07",
    "lang": "en",
    "imgUrl": "http://books.google.com/books/content?id=vHj7swEACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api",
    "status": "available",
    "category": "-",
    "pricePerWeek": 307,
    "link": "http://books.google.co.id/books?id=vHj7swEACAAJ&dq=react&hl=&as_pt=BOOKS&cd=6&source=gbs_api"
  },
  {
    "title": "React and React Native",
    "isbn": "9781839212437",
    "author": "Adam Boduch, Roy Derks",
    "synopsis": "Get up to speed with React, React Native, GraphQL and Apollo for building cross-platform native apps with the help of practical examples Key FeaturesCovers the latest features of React such as Hooks, Suspense, NativeBase, and Apollo in this updated third editionGet to grips with the React architecture for writing easy-to-manage web and mobile applicationsUnderstand GraphQL and Apollo for building a scalable backend for your cross-platform appsBook Description React and React Native, Facebook's innovative User Interface (UI) libraries, are designed to help you build robust cross-platform web and mobile applications. This updated third edition is improved and updated to cover the latest version of React. The book particularly focuses on the latest developments in the React ecosystem, such as modern Hook implementations, code splitting using lazy components and Suspense, user interface framework components using Material-UI, and Apollo. In terms of React Native, the book has been updated to version 0.62 and demonstrates how to apply native UI components for your existing mobile apps using NativeBase. You will begin by learning about the essential building blocks of React components. Next, you'll progress to working with higher-level functionalities in application development, before putting this knowledge to use by developing user interface components for the web and for native platforms. In the concluding chapters, you'll learn how to bring your application together with a robust data architecture. By the end of this book, you'll be able to build React applications for the web and React Native applications for multiple mobile platforms. What you will learnDelve into the React architecture, component properties, state, and contextGet to grips with React Hooks for handling functions and componentsImplement code splitting in React using lazy components and SuspenseBuild robust user interfaces for mobile and desktop apps using Material-UIWrite shared components for Android and iOS mobile apps using React NativeSimplify layout design for React Native apps using NativeBaseWrite GraphQL schemas to power web and mobile appsImplement web and mobile components that are driven by ApolloWho this book is for This book is for any JavaScript developer who wants to start learning how to use Facebook's UI libraries, React and React Native, for mobile and web application development. Although no prior knowledge of React is needed, working knowledge of JavaScript programming will help you understand the concepts covered in the book more effectively.",
    "pageCount": 505,
    "stock": 2,
    "publisher": "Packt Publishing Ltd",
    "publishedDate": "2020-04-30",
    "lang": "en",
    "imgUrl": "http://books.google.com/books/content?id=XCLhDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "status": "available",
    "category": "Computers",
    "pricePerWeek": 1627,
    "link": "http://books.google.co.id/books?id=XCLhDwAAQBAJ&printsec=frontcover&dq=react&hl=&as_pt=BOOKS&cd=7&source=gbs_api"
  },
  {
    "title": "Full-Stack React, TypeScript, and Node",
    "isbn": "9781839214691",
    "author": "David Choi",
    "synopsis": "Discover the current landscape of full-stack development and how to leverage modern web technologies for building production-ready React.js applications to deploy on AWS Key FeaturesUnderstand the architecture of React and single-page applicationsBuild a modern Web API for your SPA using Node.js, Express, and GraphQLGain a clear and practical understanding of how to build a complete full-stack applicationBook Description React sets the standard for building high-performance client-side web apps. Node.js is a scalable application server that is used in thousands of websites, while GraphQL is becoming the standard way for large websites to provide data and services to their users. Together, these technologies, when reinforced with the capabilities of TypeScript, provide a cutting-edge stack for complete web application development. This book takes a hands-on approach to implementing modern web technologies and the associated methodologies for building full-stack apps. You’ll begin by gaining a strong understanding of TypeScript and how to use it to build high-quality web apps. The chapters that follow delve into client-side development with React using the new Hooks API and Redux. Next, you’ll get to grips with server-side development with Express, including authentication with Redis-based sessions and accessing databases with TypeORM. The book will then show you how to use Apollo GraphQL to build web services for your full-stack app. Later, you’ll learn how to build GraphQL schemas and integrate them with React using Hooks. Finally, you’ll focus on how to deploy your application onto an NGINX server using the AWS cloud. By the end of this book, you’ll be able to build and deploy complete high-performance web applications using React, Node, and GraphQL. What you will learnDiscover TypeScript’s most important features and how they can be used to improve code quality and maintainabilityUnderstand what React Hooks are and how to build React apps using themImplement state management for your React app using ReduxSet up an Express project with TypeScript and GraphQL from scratchBuild a fully functional online forum app using React and GraphQLAdd authentication to your web app using RedisSave and retrieve data from a Postgres database using TypeORMConfigure NGINX on the AWS cloud to deploy and serve your appsWho this book is for The book is for web developers who want to go beyond front-end web development and enter the world of full-stack web development by learning about modern web technologies and how they come together. A good understanding of JavaScript programming is required before getting started with this web development book.",
    "pageCount": 648,
    "stock": 2,
    "publisher": "Packt Publishing Ltd",
    "publishedDate": "2020-12-18",
    "lang": "en",
    "imgUrl": "http://books.google.com/books/content?id=uUMQEAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "status": "available",
    "category": "Computers",
    "pricePerWeek": 2944,
    "link": "http://books.google.co.id/books?id=uUMQEAAAQBAJ&printsec=frontcover&dq=react&hl=&as_pt=BOOKS&cd=8&source=gbs_api"
  },
  {
    "title": "React: Cross-Platform Application Development with React Native",
    "isbn": "9781789139600",
    "author": "Emilio Rodriguez Martinez",
    "synopsis": "With React Native, you can build native mobile apps that are much more powerful, interactive, and faster by using JavaScript. React Native helps web and mobile developers to build cross-platform apps at a high level. This book takes you through four projects to help understand of the framework and build mobile apps with native user experience.",
    "pageCount": 183,
    "stock": 3,
    "publisher": "Packt Publishing Ltd",
    "publishedDate": "2018-03-13",
    "lang": "en",
    "imgUrl": "http://books.google.com/books/content?id=MZRRDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "status": "available",
    "category": "Computers",
    "pricePerWeek": 4306,
    "link": "http://books.google.co.id/books?id=MZRRDwAAQBAJ&printsec=frontcover&dq=react&hl=&as_pt=BOOKS&cd=9&source=gbs_api"
  },
  {
    "title": "React Native for Mobile Development",
    "isbn": "9781484244548",
    "author": "Akshat Paul, Abhishek Nalwaya",
    "synopsis": "Develop native iOS and Android apps with ease using React Native. Learn by doing through an example-driven approach, and have a substantial running app at the end of each chapter. This second edition is fully updated to include ES7 (ECMAScript 7), the latest version of React Native (including Redux), and development on Android. You will start by setting up React Native and exploring the anatomy of React Native apps. You'll then move on to Redux data flow, how it differs from flux, and how you can include it in your React Native project to solve state management differently and efficiently. You will also learn how to boost your development by including popular packages developed by the React Native community that will help you write less; do more. Finally, you'll learn to how write test cases using Jest and submit your application to the App Store. React Native challenges the status quo of native iOS and Android development with revolutionary components, asynchronous execution, unique methods for touch handling, and much more. This book reveals the the path-breaking concepts of React.js and acquaints you with the React way of thinking so you can learn to create stunning user interfaces. What You'll Learn Build stunning iOS and Android applications Understand the Redux design pattern and use it in your project Interact with iOS and android device capabilities such as addressbook, camera, GPS and more with your apps Test and launch your application to the App StoreWho This Book Is For Anyone with JavaScript experience who wants to build native mobile applications but dreads the thought of programming in Objective-C or Java. Developers who have experience with JavaScript but are new or not acquainted to React Native or ReactJS.",
    "pageCount": 243,
    "stock": 3,
    "publisher": "Apress",
    "publishedDate": "2019-06-12",
    "lang": "en",
    "imgUrl": "http://books.google.com/books/content?id=0DidDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "status": "available",
    "category": "Computers",
    "pricePerWeek": 4641,
    "link": "http://books.google.co.id/books?id=0DidDwAAQBAJ&printsec=frontcover&dq=react&hl=&as_pt=BOOKS&cd=10&source=gbs_api"
  },
  {
    "title": "Advanced Web Development with React",
    "isbn": "9789389423600",
    "author": "Mohan Mehul",
    "synopsis": "Level up your React and Next.js skills with advanced concepts about SSR and PWA Key Featuresa- Covers latest and core React concepts including React hooks and React reconcilera- Covers about Server Side Rendering with React and how to use it using Next.jsa- Covers about Progressive Web Apps in React and how to create thema- Covers intermediate and advanced React concepts like state managementa- Covers overview of React for beginners to catch with advanced concepts latera- Covers bleeding-edge React concepts on the future of React and how it would work eventuallyDescriptionThe book starts by introducing the reader to React, what it is and why you need a library like React to work with medium to large scale applications. We then move on to implementing simple client-side programs with React, uncovering modern React practices like React hooks and diving deep into various kinds of hooks. We then move to implement React on the server using Server-Side Rendering to bring benefits of the SEO world to the dynamic rendering nature of front-end libraries. For this, we use Next.js, a very popular implementation of Server-Side Rendering which comes with tons of good practices already baked in. We also take a look at how Progressive Web Apps can be created out of existing React codebases and what benefits it provides us. Finally, we end the book with some React internals (how to React works) and some bleeding-edge features in React which are expected to roll out in 2-3 years fully and would impact how to React works under the hood.What will you learna- What React is and how to get started with ita- Modern ways to code React applicationsa- Implementing Server-Side rendering with/without Next.js on the top of React librarya- Working with Progressive Web Apps in Reacta- How to React works under the hooda- Future of React and bleeding-edge React tech you can use todayWho this book is forThe reader is expected to have a decent understanding of JavaScript/HTML/CSS, and possibly, worked with React a little bit beforehand. Although the first 2 chapters cover basics of React, still it is recommended for users with at least a bit of knowledge and experience with React.Table of Contents1. React 1012. Setting up React3. Components4. State Management with React5. Server Side React6. Introduction to Next.js7. More with Next.js8. Progressive Web Apps9. Bleeding edge ReactAbout the AuthorMehul Mohan is an entrepreneur, developer and a security researcher. Currently, he is pursuing his bachelor's degree in CSE at BITS Pilani. He is a WWDC'19 Scholar, and runs codedamn - a platform for people to learn coding. You'll often find him creating programming tutorials on his YouTube channel, codedamn, having over 100,000 subscribers. He has been acknowledged by companies such as Google, Microsoft, Sony, etc. for his contributions as a security researcher. Your Blog links: https://codedamn.com https://mehulmohan.com His LinkedIn Profile: https://linkedin.com/in/mehulmpt",
    "pageCount": 184,
    "stock": 4,
    "publisher": "BPB Publications",
    "publishedDate": "2020-02-26",
    "lang": "en",
    "imgUrl": "http://books.google.com/books/content?id=0bpIEAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "status": "available",
    "category": "Computers",
    "pricePerWeek": 1780,
    "link": "http://books.google.co.id/books?id=0bpIEAAAQBAJ&printsec=frontcover&dq=react&hl=&as_pt=BOOKS&cd=11&source=gbs_api"
  },
  {
    "title": "Panduan Membuat Aplikasi Ujian Online Dengan Laravel 8, React dan Inertia",
    "isbn": "-",
    "author": "Rohi Abdulloh",
    "synopsis": "Ebook ini membahas step by step pembuatan aplikasi ujian online menggunakan Laravel 8, React dan Inertia. Laravel merupakan framework PHP paling populer saat ini untuk pengembangan aplikasi pada sisi back end. Sedangkan React merupakan framework JavaScript yang paling populer untuk pengembangan aplikasi pada sisi front end. Cara termudah mengintegrasikan Laravel dan React yaitu dengan menggunakan Inertia yang memungkinkan menggunakan Laravel dan React tanpa membuat Rest API. Beberapa fitur dalam aplikasi ini meliputi: · Import soal dari excel, sehingga soal tidak perlu input satu-satu ke aplikasi. · Import dan eksport peserta ujian dengan password dapat dibuat sendiri atau dibuat oleh aplikasi. · Export nilai dan jawaban yang dapat digunakan untuk keperluan analisis soal. · Pilihan acak soal, acak jawaban dan tampilkan hasil ujian ke siswa yang dapat diatur sesuai kebutuhan. · Pembagian sesi ujian, sehingga peserta hanya dapat mengakses ujian pada waktu yang sudah dijadwalkan. · Count down timer yang akan menghentikan ujian jika waktunya selesai. · Jika ada kejadian tak terduga, misal mati lampu atau komputer rusak, peserta dapat melanjutkan dengan waktu yang tersisa. Demo aplikasi dapat dilihat di: https://www.youtube.com/watch?v=loHmBPIc6Dg",
    "pageCount": 168,
    "stock": 5,
    "publisher": "Rohi Abdulloh",
    "publishedDate": "2021-05-05",
    "lang": "id",
    "imgUrl": "http://books.google.com/books/content?id=cqcsEAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "status": "available",
    "category": "Computers",
    "pricePerWeek": 3450,
    "link": "http://books.google.co.id/books?id=cqcsEAAAQBAJ&printsec=frontcover&dq=react&hl=&as_pt=BOOKS&cd=12&source=gbs_api"
  },
  {
    "title": "React and React Native",
    "isbn": "9781786469571",
    "author": "Adam Boduch",
    "synopsis": "Use React and React Native to build applications for desktop browsers, mobile browsers, and even as native mobile apps About This Book Build React and React Native applications using familiar component concepts Dive deep into each platform, from routing in React to creating native mobile applications that can run offline Use Facebook's Relay, React and GraphQL technologies, to create a unified architecture that powers both web and native applications Who This Book Is For This book is written for any JavaScript developer—beginner or expert—who wants to start learning how to put both of Facebook's UI libraries to work. No knowledge of React is needed, though a working knowledge of ES2015 will help you follow along better. What You Will Learn Craft reusable React components Control navigation using the React Router to help keep your UI in sync with URLs Build isomorphic web applications using Node.js Use the Flexbox layout model to create responsive mobile designs Leverage the native APIs of Android and iOS to build engaging applications with React Native Respond to gestures in a way that's intuitive for the user Use Relay to build a unified data architecture for your React UIs In Detail React and React Native allow you to build cross-platform desktop and mobile applications using Facebook's innovative UI libraries. Combined with the Flux data architecture and Relay, you can now create powerful and feature-complete applications from just one code base! This book is split into three parts. The first part shows you how to start crafting composable UIs using React, from rendering with JSX and creating reusable components through to routing and creating isomorphic applications that run on Node. We then move on to showing you how to take the concepts of React and apply them to building Native UIs using React Native. You'll find out how to build responsive and streamlined UIs that can properly handle user interactions in a mobile environment. You'll also learn how to access device-specific APIs such as the geolocation API, and how to handle offline development with React Native. Finally, we'll tie all of these skills together and shows you how you can create React applications that run on every major platform. As well as understanding application state in depth, you'll learn how to leverage Relay to make feature-complete, data-driven web and native mobile applications. Style and approach Split into three major sections to help organize your learning, this hands-on, code-first book will help you get up to speed with React and React Native—the UI framework that powers Netflix, Yahoo, and Facebook.",
    "pageCount": 485,
    "stock": 5,
    "publisher": "Packt Publishing Ltd",
    "publishedDate": "2017-03-08",
    "lang": "en",
    "imgUrl": "http://books.google.com/books/content?id=jLkrDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "status": "available",
    "category": "Computers",
    "pricePerWeek": 602,
    "link": "http://books.google.co.id/books?id=jLkrDwAAQBAJ&printsec=frontcover&dq=react&hl=&as_pt=BOOKS&cd=13&source=gbs_api"
  },
  {
    "title": "React: Building Modern Web Applications",
    "isbn": "9781786462848",
    "author": "Jonathan Hayward, Artemij Fedosejev, Narayan Prusty, Adam Horton, Ryan Vice, Ethan Holmes, Tom Bray",
    "synopsis": "Master the art of building dynamic, modern web applications with React About This Book Learn the hot new frontend web framework from Facebook – ReactJS, an easy way of developing the V in MVC and a better approach to software engineering in JavaScript A fast-paced guide to designing and building scalable and maintainable web apps with React.js Learn all the new ES6 features and be among the most prominent JavaScript developers who can write efficient JS programs as per the latest standards Master the art of building modern web applications using React Learn to build modern native iOS and Android applications using JavaScript and the incredible power of React Who This Book Is For This course is for web developers that want to unlock high performance dynamism in the applications that they create. If you want a comprehensive journey into one of the most important JavaScript frameworks around today, dive into this course. What You Will Learn Take control of the front end with reactive JavaScript programming Discover what ReactJS offers your development - before mastering it Create React elements with properties and children Use JSX to speed up your React development process Test your React components with the Jest test framework Learn the latest syntax of ES6 Execute ES6 in a non-supported ES6 environment Learn the principles of object-oriented programming Create a complete single-page application Use an application design plan to write smarter, more meaningful code Learn how to use animations to give extra style to your application Get to grips with the React Native environment Write your own custom native UI components Integrate native modules in Objective-C and Java that interact with JavaScript In Detail ReactJS has helped to transform the web as we know it. Designed by Facebook to help developers build rapid, responsive UI that can deal with data-intensive usage, it's an essential component in any web developer's skillset. This ReactJS course, in five connected modules, provides you with a fast, engaging and practical route into ReactJS—so you can build powerful, elegant, and modern web applications. Beginning with the Reactive Programming with JavaScript module, you will learn how to take advantage of a reactive and functional programming paradigm to rethink how you approach your JavaScript code. It's built to help you understand the concepts, relevant and applicable for any frontend developer. You'll then dive a little deeper into ReactJS. The second module gives you a rapid look through the fundamentals of ReactJS, showing you how to build a basic application and demonstrating how to implement the Flux architecture. In the third module you will get to grips with ES6—this will make you a more fluent JavaScript developer, giving you control over ReactJS. You can put your old JavaScript hacks aside and instead explore how to create ES6 custom iterators. In the final two modules you'll learn how to fully master ReactJS, exploring its wider ecosystem of tools that have helped to make it one of the most important tools in web development today. Ending with insights and guidance on React Native, the tool built for today's demand for native, intuitive user experiences and interfaces, with this course you can be confident in building dynamic and modern apps with React. Style and approach Consisting of five separate modules, journey from the fundamentals of reactive programming to the exciting possibilities of React Native. Each module builds on each other, helping you to incrementally develop your skills and knowledge.",
    "pageCount": 910,
    "stock": 1,
    "publisher": "Packt Publishing Ltd",
    "publishedDate": "2016-06-10",
    "lang": "en",
    "imgUrl": "http://books.google.com/books/content?id=jUvZDQAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "status": "available",
    "category": "Computers",
    "pricePerWeek": 3483,
    "link": "http://books.google.co.id/books?id=jUvZDQAAQBAJ&printsec=frontcover&dq=react&hl=&as_pt=BOOKS&cd=14&source=gbs_api"
  },
  {
    "title": "Essentials of Javascript",
    "isbn": "-",
    "author": "Shaaran Lakshminarayanan",
    "synopsis": "Do you want to make applications for Android and iOS ? Are you a developer who is bored of writing code for both Android and iOS ? In this series of books we will overcome the problem of having to write code for Android and iOS by using React Native. React Native is a framework developed by Facebook for creating native-style apps for iOS & Android under one common language, JavaScript. Initially, Facebook only developed React Native to support iOS. However with its recent support of the Android operating system, the library can now render mobile UIs for both platforms. Why React Native ? Not only react native allows you to create cross platform applications but react native also makes updating apps simple through over-the-app updates. Over the air update in react native is achieved through technologies such as CodePush with a few lines of code. Armed with React Native you’ll finally be able to make apps of your choice in no time and I’m glad to show you what React Native can do through this series of books. In this book we will learn the core concepts of Javascript to help us with our React Native Journey.",
    "pageCount": 27,
    "stock": 1,
    "publisher": "Shaaran Lakshminarayanan",
    "publishedDate": "2020-05-12",
    "lang": "en",
    "imgUrl": "http://books.google.com/books/content?id=A1fjDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "status": "available",
    "category": "Computers",
    "pricePerWeek": 2348,
    "link": "http://books.google.co.id/books?id=A1fjDwAAQBAJ&printsec=frontcover&dq=react&hl=&as_pt=BOOKS&cd=15&source=gbs_api"
  },
  {
    "title": "Full-Stack Web Development with GraphQL and React",
    "isbn": "9781801079174",
    "author": "Sebastian Grebe",
    "synopsis": "Unleash the power of GraphQL, React 17, Node, and Express to build a scalable and production-ready application from scratch to be deployed on AWS Key FeaturesBuild full-stack applications with modern APIs using GraphQL and React HooksIntegrate Apollo into React and build frontend components using GraphQLImplement a self-updating notification pop-up with a unique GraphQL feature called SubscriptionsBook Description React and GraphQL, when combined, provide you with a very dynamic, efficient, and stable tech stack to build web-based applications. GraphQL is a modern solution for querying an API that represents an alternative to REST and is the next evolution in web development. This book guides you in creating a full-stack web application from scratch using modern web technologies such as Apollo, Express.js, Node.js, and React. First, you'll start by configuring and setting up your development environment. Next, the book demonstrates how to solve complex problems with GraphQL, such as abstracting multi-table database architectures and handling image uploads using Sequelize. You'll then build a complete Graphbook from scratch. While doing so, you'll cover the tricky parts of connecting React to the backend, and maintaining and synchronizing state. In addition to this, you'll also learn how to write Reusable React components and use React Hooks. Later chapters will guide you through querying data and authenticating users in order to enable user privacy. Finally, you'll explore how to deploy your application on AWS and ensure continuous deployment using Docker and CircleCI. By the end of this web development book, you'll have learned how to build and deploy scalable full-stack applications with ease using React and GraphQL. What you will learnBuild a GraphQL API by implementing models and schemas with Apollo and SequelizeSet up an Apollo Client and build frontend components using ReactWrite Reusable React components and use React HooksAuthenticate and query user data using GraphQLUse Mocha to write test cases for your full-stack applicationDeploy your application to AWS using Docker and CircleCIWho this book is for This React GraphQL book is for web developers familiar with React and GraphQL who want to enhance their skills and build full-stack applications using industry standards like React, Apollo, Node.js, and SQL at scale while learning to solve complex problems with GraphQL.",
    "pageCount": 473,
    "stock": 3,
    "publisher": "Packt Publishing Ltd",
    "publishedDate": "2022-02-28",
    "lang": "en",
    "imgUrl": "http://books.google.com/books/content?id=GPBbEAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "status": "available",
    "category": "Computers",
    "pricePerWeek": 4265,
    "link": "http://books.google.co.id/books?id=GPBbEAAAQBAJ&printsec=frontcover&dq=react&hl=&as_pt=BOOKS&cd=16&source=gbs_api"
  },
  {
    "title": "React Components",
    "isbn": "9781785883729",
    "author": "Christopher Pitt",
    "synopsis": "Explore the power of React components for cutting-edge web development About This Book Learn to build better websites by creating a variety of different components in React Conceptualize the design and build maintainable web apps with the help of components A fast-paced guide to help you learn about component-based development in React Who This Book Is For This book is ideal for developers who are familiar with the basics of React and are looking for a guide to building a wide range of components as well as develop component-driven UIs. What You Will Learn How to structure an app into components Working with nested components Work with nested components Set up communication across components Style the existing components Work with Material Design as a component Render components on the server Make the best of design patterns Make the app pluggable In Detail The reader will learn how to use React and its component-based architecture in order to develop modern user interfaces. A new holistic way of thinking about UI development will establish throughout this book and the reader will discover the power of React components with many examples. After reading the book and following the example application, the reader has built a small to a mid-size application with React using a component based UI architecture. The book will take the reader through a journey to discover the benefits of component-based user interfaces over the classical MVC architecture. Throughout the book, the reader will develop a wide range of components and then bring them together to build a component-based UI. By the end of this book, readers would have learned several techniques to build powerful components and how the component-based development is beneficial over regular web development. Style and approach This book is a compact, example-driven guide that provides a step-by-step approach.",
    "pageCount": 182,
    "stock": 5,
    "publisher": "Packt Publishing Ltd",
    "publishedDate": "2016-04-21",
    "lang": "en",
    "imgUrl": "http://books.google.com/books/content?id=_97JDAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "status": "available",
    "category": "Computers",
    "pricePerWeek": 3119,
    "link": "http://books.google.co.id/books?id=_97JDAAAQBAJ&printsec=frontcover&dq=react&hl=&as_pt=BOOKS&cd=17&source=gbs_api"
  },
  {
    "title": "Learning React Js",
    "isbn": "9798677494260",
    "author": "Claudia Alves",
    "synopsis": "You may have picked up this book with some level of JavaScript knowledge. There is also a high probability that you have an idea of what React js is. This chapter highlights the key aspects of React as a framework, explains the problems it solves, and describes how you can utilize the features and the rest of the information contained in this book to better your web development practices and create complex, yet maintainable user interfaces using React.Defining React jsReact js is a JavaScript framework. React was originally created by engineers at Facebook to solve the challenges involved when developing complex user interfaces with datasets that change over time. This is not a trivial undertaking and must not only be maintainable, but also scalable to work at the scale of Facebook. React js was actually born in Facebook's ads organization, where they had been utilizing a traditional client-side Model-View-Controller approach. Applications such as these normally consist of two-way data binding along with rendering template. React changed the way that these applications were created by making some daring advances in web development. When React js was released in 2013, the web development community was both interested and seemingly disgusted by what React was doing. As you will discover throughout this book, React challenges conventions that have become the de-facto standards for JavaScript framework best practices. React does this by introducing many new paradigms and shifting the status quo of what it takes to create scalable and maintainable JavaScript applications and user interfaces. Along with the shift in front-end development mentality, React comes with a rich set of features that make composing a single-page application or user interface approachable for developers of many skill levels-from those who have just been introduced to JavaScript, to seasoned veterans of the web. You will see these features-such as the virtual DOM, JSX, and Flux concepts-as you read this book and discover how they can be used to create complex user interfaces.You will also see, in brief, how Facebook is continually challenging the development world with React Native. React Native is a new open source library for creating native user interfaces utilizing the same principles as React's JavaScript library. By creating a Native UI library, React has pushed its value proposition of \"learn once, write anywhere.\" This paradigm shift applies to being able to utilize the core concepts of React in order to make maintainable interfaces. By now it is possible you are thinking that there is nothing React can't do when it comes to development. This is not the case, and in order to further understand what React is, you need an understanding of what React is not, which you learn later in this chapter. First, you will understand the underlying problems that caused React to be created and how React solves those problems.",
    "pageCount": 144,
    "stock": 3,
    "publisher": "Independently Published",
    "publishedDate": "2020-08-21",
    "lang": "en",
    "imgUrl": "http://books.google.com/books/content?id=BhDBzQEACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api",
    "status": "available",
    "category": "-",
    "pricePerWeek": 4677,
    "link": "http://books.google.co.id/books?id=BhDBzQEACAAJ&dq=react&hl=&as_pt=BOOKS&cd=18&source=gbs_api"
  },
  {
    "title": "Beginning React",
    "isbn": "9781789534924",
    "author": "Andrea Chiarelli",
    "synopsis": "Take your web applications to a whole new level with efficient, component-based UIs that deliver cutting-edge interactivity and performance. Key Features Elaborately explains basics before introducing advanced topics Explains creating and managing the state of components across applications Implement over 15 practical activities and exercises across 11 topics to reinforce your learning Book Description Projects like Angular and React are rapidly changing how development teams build and deploy web applications to production. In this book, you’ll learn the basics you need to get up and running with React and tackle real-world projects and challenges. It includes helpful guidance on how to consider key user requirements within the development process, and also shows you how to work with advanced concepts such as state management, data-binding, routing, and the popular component markup that is JSX. As you complete the included examples, you’ll find yourself well-equipped to move onto a real-world personal or professional frontend project. What you will learn Understand how React works within a wider application stack Analyze how you can break down a standard interface into specific components Successfully create your own increasingly complex React components with HTML or JSX Correctly handle multiple user events and their impact on overall application state Understand the component lifecycle to optimize the UX of your application Configure routing to allow effortless, intuitive navigation through your components Who this book is for If you are a frontend developer who wants to create truly reactive user interfaces in JavaScript, then this is the book for you. For React, you’ll need a solid foundation in the essentials of the JavaScript language, including new OOP features that were introduced in ES2015. An understanding of HTML and CSS is assumed, and a basic knowledge of Node.js will be useful in the context of managing a development workflow, but is not essential.",
    "pageCount": 90,
    "stock": 5,
    "publisher": "Packt Publishing Ltd",
    "publishedDate": "2018-07-25",
    "lang": "en",
    "imgUrl": "http://books.google.com/books/content?id=cWdmDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "status": "available",
    "category": "Computers",
    "pricePerWeek": 2346,
    "link": "http://books.google.co.id/books?id=cWdmDwAAQBAJ&printsec=frontcover&dq=react&hl=&as_pt=BOOKS&cd=19&source=gbs_api"
  },
  {
    "title": "React 17 Design Patterns and Best Practices",
    "isbn": "9781800561762",
    "author": "Carlos Santana Roldan",
    "synopsis": "Build scalable, maintainable, and powerful React web apps with design patterns and insightful best practices Key Features Make the most of design patterns in React – including render props and controlled and uncontrolled inputs Master React Hooks with the help of this updated third edition Work through examples that can be used to create reusable code and extensible designs Book Description Filled with useful React patterns that you can use in your projects straight away, this book will help you save time and build better web applications with ease. React 17 Design Patterns and Best Practices is a hands-on guide for those who want to take their coding skills to a new level. You'll spend most of your time working your way through the principles of writing maintainable and clean code, but you'll also gain a deeper insight into the inner workings of React. As you progress through the chapters, you'll learn how to build components that are reusable across the application, how to structure applications, and create forms that actually work. Then you'll build on your knowledge by exploring how to style React components and optimize them to make applications faster and more responsive. Once you've mastered the rest, you'll learn how to write tests effectively and how to contribute to React and its ecosystem. By the end of this book, you'll be able to avoid the process of trial and error and developmental headaches. Instead, you'll be able to use your new skills to efficiently build and deploy real-world React web applications you can be proud of. What you will learn Get to grips with the techniques of styling and optimizing React components Create components using the new React Hooks Use server-side rendering to make applications load faster Get up to speed with the new React Suspense technique and using GraphQL in your projects Write a comprehensive set of tests to create robust and maintainable code Build high-performing applications by optimizing components Who this book is for This book is for web developers who want to understand React better and apply it to real-life app development. You'll need an intermediate-level experience with React and JavaScript before you get started.",
    "pageCount": 381,
    "stock": 1,
    "publisher": "Packt Publishing Ltd",
    "publishedDate": "2021-05-17",
    "lang": "en",
    "imgUrl": "http://books.google.com/books/content?id=viIvEAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "status": "available",
    "category": "Computers",
    "pricePerWeek": 1929,
    "link": "http://books.google.co.id/books?id=viIvEAAAQBAJ&printsec=frontcover&dq=react&hl=&as_pt=BOOKS&cd=20&source=gbs_api"
  },
  {
    "title": "Encyclopedia of World Biography",
    "isbn": "WISC:89063818827",
    "author": "-",
    "synopsis": "Presents brief biographical sketches which provide vital statistics as well as information on the importance of the person listed.",
    "pageCount": 558,
    "stock": 4,
    "publisher": "Gale",
    "publishedDate": "1998",
    "lang": "en",
    "imgUrl": "http://books.google.com/books/content?id=UbWRXPJnwbQC&printsec=frontcover&img=1&zoom=1&source=gbs_api",
    "status": "available",
    "category": "Biography",
    "pricePerWeek": 368,
    "link": "http://books.google.co.id/books?id=UbWRXPJnwbQC&q=bio&dq=bio&hl=&as_pt=BOOKS&cd=1&source=gbs_api"
  },
  {
    "title": "Virgil Thomson",
    "isbn": "UOM:39015010408246",
    "author": "Michael Meckna",
    "pageCount": 240,
    "stock": 4,
    "publisher": "Greenwood",
    "publishedDate": "1986-08-13",
    "lang": "en",
    "imgUrl": "http://books.google.com/books/content?id=sT0bAAAAMAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api",
    "status": "available",
    "category": "Music",
    "pricePerWeek": 1626,
    "link": "http://books.google.co.id/books?id=sT0bAAAAMAAJ&pg=PR14&dq=bio&hl=&as_pt=BOOKS&cd=2&source=gbs_api"
  },
  {
    "title": "AWS CLI Command",
    "isbn": "-",
    "author": "RB ASHISH",
    "synopsis": "Master the step by step guide to AWS CLI Command Amazon Web Services Cmd line Interface. With just single tool you can configure, control and manage all your AWS Services through command line and automate them with scripts. Some of the services includes are: • apigateway • autoscaling • batch • cloudformation • dynamodb • ec2 • glacier • iam • kms • lambda • machinelearning • rds • route53 • s3 • swf • waf and more.",
    "pageCount": 26,
    "stock": 3,
    "publisher": "CreateSpace",
    "publishedDate": "2018-10-08",
    "lang": "en",
    "imgUrl": "http://books.google.com/books/content?id=4aFmDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "status": "available",
    "category": "Computers",
    "pricePerWeek": 1072,
    "link": "http://books.google.co.id/books?id=4aFmDwAAQBAJ&pg=PA21&dq=bio&hl=&as_pt=BOOKS&cd=3&source=gbs_api"
  },
  {
    "title": "Bulletin",
    "isbn": "STANFORD:36105032873403",
    "author": "-",
    "pageCount": 246,
    "stock": 3,
    "publishedDate": "1980",
    "lang": "en",
    "imgUrl": "http://books.google.com/books/content?id=rypRAQAAIAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api",
    "status": "available",
    "category": "Geology",
    "pricePerWeek": 1743,
    "link": "http://books.google.co.id/books?id=rypRAQAAIAAJ&q=bio&dq=bio&hl=&as_pt=BOOKS&cd=4&source=gbs_api"
  },
  {
    "title": "Mohammad Amien Rais",
    "isbn": "UOM:39015061569961",
    "author": "Zaim Uchrowi",
    "synopsis": "Biography of Mohammad Amien Rais, an Indonesian Muslim political leader.",
    "pageCount": 400,
    "stock": 3,
    "publishedDate": "2004",
    "lang": "id",
    "imgUrl": "http://books.google.com/books/content?id=U_1wAAAAMAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api",
    "status": "available",
    "category": "Indonesia",
    "pricePerWeek": 3010,
    "link": "http://books.google.co.id/books?id=U_1wAAAAMAAJ&q=bio&dq=bio&hl=&as_pt=BOOKS&cd=5&source=gbs_api"
  },
  {
    "title": "Gian Carlo Menotti",
    "isbn": "9780313095948",
    "author": "Donald L. Hixon",
    "synopsis": "Gian Carlo Menotti is a composer known chiefly for his popular operas, including Amahl and the Night Visitors, The Medium, and The Consul. He also wrote a considerable amount of choral, instrumental and chamber music. This addition to the Greenwood Press series Bio-Bibliographies in Music serves as a reference guide to Menotti's career. A brief biographical sketch precedes a chronologically arranged bibliography of general writings by and about Menotti followed by a detailed list of works, alphabetically arranged. A bibliography of writings about specific compositions, complete with selected contemporary critical reviews, includes data on premiers and other significant performances and discographies of recordings. Opera music scholars, along with Menotti fans, will appreciate this detailed guide to available research materials. Intended as a scholarly resource, this volume also includes two appendices, a chronological list of works and a genre list of works. An author index and a separate performer index are provided.",
    "pageCount": 356,
    "stock": 3,
    "publisher": "Bloomsbury Publishing USA",
    "publishedDate": "2000-02-28",
    "lang": "en",
    "imgUrl": "http://books.google.com/books/content?id=iknEEAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "status": "available",
    "category": "Music",
    "pricePerWeek": 3008,
    "link": "http://books.google.co.id/books?id=iknEEAAAQBAJ&printsec=frontcover&dq=bio&hl=&as_pt=BOOKS&cd=6&source=gbs_api"
  },
  {
    "title": "Linux Device Drivers",
    "isbn": "9780596005900",
    "author": "Jonathan Corbet, Alessandro Rubini, Greg Kroah-Hartman",
    "synopsis": "Provides information on writing a driver in Linux, covering such topics as character devices, network interfaces, driver debugging, concurrency, and interrupts.",
    "pageCount": 636,
    "stock": 2,
    "publisher": "\"O'Reilly Media, Inc.\"",
    "publishedDate": "2005-02-07",
    "lang": "en",
    "imgUrl": "http://books.google.com/books/content?id=MTibAgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "status": "available",
    "category": "Computers",
    "pricePerWeek": 859,
    "link": "http://books.google.co.id/books?id=MTibAgAAQBAJ&pg=PT512&dq=bio&hl=&as_pt=BOOKS&cd=7&source=gbs_api"
  },
  {
    "title": "Allgemeines Künstlerlexikon Bio-bibliographischer Index A-Z",
    "isbn": "UCSC:32106020097306",
    "author": "-",
    "pageCount": 904,
    "stock": 2,
    "publishedDate": "1999",
    "lang": "en",
    "imgUrl": "http://books.google.com/books/content?id=U8kiAQAAIAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api",
    "status": "available",
    "category": "Allgemeines Künstlerlexikon",
    "pricePerWeek": 893,
    "link": "http://books.google.co.id/books?id=U8kiAQAAIAAJ&dq=bio&hl=&as_pt=BOOKS&cd=8&source=gbs_api"
  },
  {
    "title": "Bioethanol Production from Food Crops",
    "isbn": "9780128137673",
    "author": "Ramesh C. Ray, S Ramachandran",
    "synopsis": "Bioethanol Production from Food Crops: Sustainable Sources, Interventions and Challenges comprehensively covers the global scenario of ethanol production from both food and non-food crops and other sources. The book guides readers through the balancing of the debate on food vs. fuel, giving important insights into resource management and the environmental and economic impact of this balance between demands. Sections cover Global Bioethanol from Food Crops and Forest Resource, Bioethanol from Bagasse and Lignocellulosic wastes, Bioethanol from algae, and Economics and Challenges, presenting a multidisciplinary approach to this complex topic. As biofuels continue to grow as a vital alternative energy source, it is imperative that the proper balance is reached between resource protection and human survival. This book provides important insights into achieving that balance. Presents technological interventions in ethanol production, from plant biomass, to food crops Addresses food security issues arising from bioethanol production Identifies development bottlenecks and areas where collaborative efforts can help develop more cost-effective technology",
    "pageCount": 460,
    "stock": 5,
    "publisher": "Academic Press",
    "publishedDate": "2018-08-20",
    "lang": "en",
    "imgUrl": "http://books.google.com/books/content?id=sm9qDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "status": "available",
    "category": "Technology & Engineering",
    "pricePerWeek": 2527,
    "link": "http://books.google.co.id/books?id=sm9qDwAAQBAJ&pg=PA408&dq=bio&hl=&as_pt=BOOKS&cd=9&source=gbs_api"
  },
  {
    "title": "Proceedings of the 15th International Symposium on Bioluminescence and Chemiluminescence",
    "isbn": "9789812839572",
    "author": "Xun Shen, Xiao-Lin Yang, Xin-Rong Zhang",
    "synopsis": "In the last decade, great advances have been made in fundamental research and in the applications of bioluminescence and chemiluminescence. These techniques have become vital tools for laboratory analysis. Bioluminescence imaging has emerged as a powerful new optical imaging technique, offering real-time monitoring of spatial and temporal progression of biological processes in living animals. Bioluminescence resonance energy transfer (BRET) methodology has also emerged as a powerful technique for the study of proteinprotein interactions. Luciferase reporter gene technology facilitates monitoring of gene expression and is used to probe molecular mechanisms in the regulation of gene expression. Chemiluminescence detection and analysis have also found diverse applications in life science research; for example, chemiluminescent labels and substrates are now widely used in immunoassay and nucleic acid probe-based assays. The latest advances in this exciting field, from fundamental research to cutting-edge applications, are explored in this most recent volume of the biannual symposium series, the Proceedings of the 15th International Symposium on Bioluminescence and Chemiluminescence. The volume highlights advances in fundamental knowledge of luciferase-based bioluminescence, photoprotein-based bioluminescence, fundamental aspects and applications of chemiluminescence, luminescence imaging, fluorescence quantum dots and other inorganic fluorescent materials, phosphorescence and ultraweak luminescence, and instrumentation for measurement and imaging of luminescence.",
    "pageCount": 504,
    "stock": 5,
    "publisher": "World Scientific",
    "publishedDate": "2008",
    "lang": "en",
    "imgUrl": "http://books.google.com/books/content?id=47tpDQAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "status": "available",
    "category": "Science",
    "pricePerWeek": 3618,
    "link": "http://books.google.co.id/books?id=47tpDQAAQBAJ&pg=PA415&dq=bio&hl=&as_pt=BOOKS&cd=10&source=gbs_api"
  },
  {
    "title": "Decision-Making for Biomass-Based Production Chains",
    "isbn": "9780128142790",
    "author": "Sebnem Yilmaz Balaman",
    "synopsis": "Decision-Making for Biomass-Based Production Chains: The Basic Concepts and Medothologies presents a comprehensive study of key-issues surrounding the integration of strategic, tactical and operational decision levels for supply chains in the biomass, biofuels and biorefining sectors. Comprehensive sections cover biomass resources, harvesting, collection, storage and distribution systems, along with the necessary technical and technological background of production systems. In addition, the basics of decision-making, problems and decision levels encountered in design, management and operation phases are covered. Case studies are supplied in each chapter, along with a discussion and comparative analysis of topics. The book presents a clear vision of advances in the field. Graduate students and those starting in this line of research will also find the necessary information on how to model this kind of complex system. Finally, this comprehensive resource can be used as a guide for non-expert industry decision-makers and government policymakers who need a thorough overview on the industry. Examines analytic methodologies for complex decision-making when designing, deploying and managing biomass and bio-based products supply chains Includes real-life examples of main sustainability indicators, standards and certification schemes from the European Union, United States and worldwide Explores the progress of decision-making procedures to provide a detailed perspective for effective selection of the most reliable solutions for each kind of problem Provides detailed, in-depth analyses of various models and frameworks for their implementation, challenges and solutions Presents multi-criteria and multi-objective decision-making and modeling approaches, including mathematical modeling, simulation-based modeling, and artificial intelligence-based modeling",
    "pageCount": 258,
    "stock": 5,
    "publisher": "Academic Press",
    "publishedDate": "2018-10-02",
    "lang": "en",
    "imgUrl": "http://books.google.com/books/content?id=NxlxDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "status": "available",
    "category": "Science",
    "pricePerWeek": 785,
    "link": "http://books.google.co.id/books?id=NxlxDwAAQBAJ&pg=PA67&dq=bio&hl=&as_pt=BOOKS&cd=11&source=gbs_api"
  },
  {
    "title": "Healing across Boundaries",
    "isbn": "9781317324737",
    "author": "Makarand R. Paranjape",
    "synopsis": "This unique volume initiates a dialogue between bio-medicine and alternative therapeutics. Undertaking a multidisciplinary exploration of the science and spirituality of healing and wellness, it offers varied perspectives from doctors, medical researchers, Ayurvedic practitioners, philosophers, psychologists, sociologists, and cultural critics. It expands the horizons of health sciences in engaging with diverse traditions — bio-medicine, Ayurveda, Siddha, and Jaina bio-ethics. The book will interest scholars and researchers in social and community medicine, biological sciences, sociology and social anthropology, as well as cultural studies.",
    "pageCount": 268,
    "stock": 4,
    "publisher": "Routledge",
    "publishedDate": "2015-08-12",
    "lang": "en",
    "imgUrl": "http://books.google.com/books/content?id=zcBcCgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "status": "available",
    "category": "Medical",
    "pricePerWeek": 1266,
    "link": "http://books.google.co.id/books?id=zcBcCgAAQBAJ&printsec=frontcover&dq=bio&hl=&as_pt=BOOKS&cd=12&source=gbs_api"
  },
  {
    "title": "Microbial Sensing in Fermentation",
    "isbn": "9781119247982",
    "author": "Satinder K. Brar, Ratul K. Das, Saurabh J. Sarma",
    "synopsis": "A comprehensive review of the fundamental molecular mechanisms in fermentation and explores the microbiology of fermentation technology and industrial applications Microbial Sensing in Fermentation presents the fundamental molecular mechanisms involved in the process of fermentation and explores the applied art of microbiology and fermentation technology. The text contains descriptions regarding the extraordinary sensing ability of microorganisms towards small physicochemical changes in their surroundings. The contributors — noted experts in the field — cover a wide range of topics such as microbial metabolism and production (fungi, bacteria, yeast etc); refined and non-refined carbon sources; bioprocessing; microbial synthesis, responses and performance; and biochemical, molecular and extra/intracellular controlling. This resource contains a compilation of literature on biochemical and cellular level mechanisms for microbial controlled production and includes the most significant recent advances in industrial fermentation. The text offers a balanced approach between theory and practical application, and helps readers gain a clear understanding of microbial physiological adaptation during fermentation and its cumulative effect on productivity. This important book: Presents the fundamental molecular mechanisms involved in microbial sensing in relation to fermentation technology Includes information on the significant recent advances in industrial fermentation Contains contributions from a panel of highly-respected experts in their respective fields Offers a resource that will be essential reading for scientists, professionals and researchers from academia and industry with an interest in the biochemistry and microbiology of fermentation technology Written for researchers, graduate and undergraduate students from diverse backgrounds, such as biochemistry and applied microbiology, Microbial Sensing in Fermentation offers a review of the fundamental molecular mechanisms involved in the process of fermentation.",
    "pageCount": 344,
    "stock": 3,
    "publisher": "John Wiley & Sons",
    "publishedDate": "2018-10-08",
    "lang": "en",
    "imgUrl": "http://books.google.com/books/content?id=v3JyDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "status": "available",
    "category": "Science",
    "pricePerWeek": 1805,
    "link": "http://books.google.co.id/books?id=v3JyDwAAQBAJ&pg=PA307&dq=bio&hl=&as_pt=BOOKS&cd=13&source=gbs_api"
  },
  {
    "title": "Apache Spark Graph Processing",
    "isbn": "9781784398958",
    "author": "Rindra Ramamonjison",
    "synopsis": "Build, process and analyze large-scale graph data effectively with Spark About This Book Find solutions for every stage of data processing from loading and transforming graph data to Improve the scalability of your graphs with a variety of real-world applications with complete Scala code. A concise guide to processing large-scale networks with Apache Spark. Who This Book Is For This book is for data scientists and big data developers who want to learn the processing and analyzing graph datasets at scale. Basic programming experience with Scala is assumed. Basic knowledge of Spark is assumed. What You Will Learn Write, build and deploy Spark applications with the Scala Build Tool. Build and analyze large-scale network datasets Analyze and transform graphs using RDD and graph-specific operations Implement new custom graph operations tailored to specific needs. Develop iterative and efficient graph algorithms using message aggregation and Pregel abstraction Extract subgraphs and use it to discover common clusters Analyze graph data and solve various data science problems using real-world datasets. In Detail Apache Spark is the next standard of open-source cluster-computing engine for processing big data. Many practical computing problems concern large graphs, like the Web graph and various social networks. The scale of these graphs - in some cases billions of vertices, trillions of edges - poses challenges to their efficient processing. Apache Spark GraphX API combines the advantages of both data-parallel and graph-parallel systems by efficiently expressing graph computation within the Spark data-parallel framework. This book will teach the user to do graphical programming in Apache Spark, apart from an explanation of the entire process of graphical data analysis. You will journey through the creation of graphs, its uses, its exploration and analysis and finally will also cover the conversion of graph elements into graph structures. This book begins with an introduction of the Spark system, its libraries and the Scala Build Tool. Using a hands-on approach, this book will quickly teach you how to install and leverage Spark interactively on the command line and in a standalone Scala program. Then, it presents all the methods for building Spark graphs using illustrative network datasets. Next, it will walk you through the process of exploring, visualizing and analyzing different network characteristics. This book will also teach you how to transform raw datasets into a usable form. In addition, you will learn powerful operations that can be used to transform graph elements and graph structures. Furthermore, this book also teaches how to create custom graph operations that are tailored for specific needs with efficiency in mind. The later chapters of this book cover more advanced topics such as clustering graphs, implementing graph-parallel iterative algorithms and learning methods from graph data. Style and approach A step-by-step guide that will walk you through the key ideas and techniques for processing big graph data at scale, with practical examples that will ensure an overall understanding of the concepts of Spark.",
    "pageCount": 148,
    "stock": 2,
    "publisher": "Packt Publishing Ltd",
    "publishedDate": "2015-09-10",
    "lang": "en",
    "imgUrl": "http://books.google.com/books/content?id=cgSKCgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "status": "available",
    "category": "Computers",
    "pricePerWeek": 3913,
    "link": "http://books.google.co.id/books?id=cgSKCgAAQBAJ&pg=PA66&dq=bio&hl=&as_pt=BOOKS&cd=14&source=gbs_api"
  },
  {
    "title": "p-Adic Valued Distributions in Mathematical Physics",
    "isbn": "9789401583565",
    "author": "Andrei Y. Khrennikov",
    "synopsis": "Numbers ... , natural, rational, real, complex, p-adic .... What do you know about p-adic numbers? Probably, you have never used any p-adic (nonrational) number before now. I was in the same situation few years ago. p-adic numbers were considered as an exotic part of pure mathematics without any application. I have also used only real and complex numbers in my investigations in functional analysis and its applications to the quantum field theory and I was sure that these number fields can be a basis of every physical model generated by nature. But recently new models of the quantum physics were proposed on the basis of p-adic numbers field Qp. What are p-adic numbers, p-adic analysis, p-adic physics, p-adic probability? p-adic numbers were introduced by K. Hensel (1904) in connection with problems of the pure theory of numbers. The construction of Qp is very similar to the construction of (p is a fixed prime number, p = 2,3,5, ... ,127, ... ). Both these number fields are completions of the field of rational numbers Q. But another valuation 1 . Ip is introduced on Q instead of the usual real valuation 1 . I· We get an infinite sequence of non isomorphic completions of Q : Q2, Q3, ... , Q127, ... , IR = Qoo· These fields are the only possibilities to com plete Q according to the famous theorem of Ostrowsky.",
    "pageCount": 264,
    "stock": 1,
    "publisher": "Springer Science & Business Media",
    "publishedDate": "2013-03-09",
    "lang": "en",
    "imgUrl": "http://books.google.com/books/content?id=JxYaCQAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "status": "available",
    "category": "Science",
    "pricePerWeek": 855,
    "link": "http://books.google.co.id/books?id=JxYaCQAAQBAJ&pg=PA167&dq=bio&hl=&as_pt=BOOKS&cd=15&source=gbs_api"
  },
  {
    "title": "Menteri Pertanian: Bicara Flu Burung (Bungaran Saragih, Anton Apriyantono)",
    "isbn": "9786233440561",
    "author": "Pusat Data Dan Analisa Tempo",
    "synopsis": "Menteri Pertanian: Bicara Flu Burung (Bungaran Saragih, Anton Apriyantono)",
    "stock": 2,
    "publisher": "Tempo Publishing",
    "lang": "id",
    "imgUrl": "http://books.google.com/books/content?id=_EZSEAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "status": "available",
    "category": "-",
    "pricePerWeek": 2065,
    "link": "http://books.google.co.id/books?id=_EZSEAAAQBAJ&printsec=frontcover&dq=bio&hl=&as_pt=BOOKS&cd=16&source=gbs_api"
  },
  {
    "title": "Billy the Kid, a Bio-bibliography",
    "isbn": "UOM:39015011373282",
    "author": "Jon Tuska",
    "pageCount": 264,
    "stock": 2,
    "publisher": "Greenwood",
    "publishedDate": "1983",
    "lang": "en",
    "imgUrl": "http://books.google.com/books/content?id=6op5AAAAMAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api",
    "status": "available",
    "category": "COLLECTIVE BIOGRAPHY",
    "pricePerWeek": 3612,
    "link": "http://books.google.co.id/books?id=6op5AAAAMAAJ&dq=bio&hl=&as_pt=BOOKS&cd=17&source=gbs_api"
  },
  {
    "title": "Mechanics of Bio-Sediment Transport",
    "isbn": "9783662611586",
    "author": "Hongwei Fang, Lei Huang, Huiming Zhao, Wei Cheng, Yishan Chen, Mehdi Fazeli, Qianqian Shang",
    "synopsis": "The main focus of this book is the transport mechanics of sediment particles coated with microbial biofilm, which is called bio-sediment. The book also addresses the question of how to measure and simulate the considerable variation in the properties of natural sediment associated with microbial biofilm, ranging from the micro-scale surface morphology to the macro-scale sediment transport. Nowadays most studies to elucidate the mechanisms of sediment transport have concentrated on physical-chemical sediment properties, little work explicitly coupled sediment dynamics and the environmental effects under the influence of micro-ecosystem, thus leaving a serious gap in water and sediment sciences as well as water ecological research. With respect to physical-chemical sediment properties, this book has been undertaken to evaluate and quantify the effect of biological factors - biofilm on sediment transport mechanics. The chapters cover topics including development of bio-sediment and its properties; model of biofilm growth on sediment substratum; bedform and flow resistance of bio-sediment bed; incipient velocity and settling velocity of bio-sediment; bedload and suspended load transport for bio-sediment; numerical simulation of bio-sediment transport. Besides, the measurement technology, analysis method and expression approach introduced in this book combine the characteristics of hydraulic, environmental and microbial research, having more immediate innovation. This book will be of interest to researchers, managers, practitioners, policy and decision makers, international institutions, governmental and non-governmental organizations, educators, as well as graduate and undergraduate students in the field of hydraulics and river dynamics. It will help to understand the relevance of sediment transport and biofilm growth under the role of aqueous micro-ecosystem, to introduce better tools for the simulation and prediction of bio-sediment transport, and to provide a scientific basis and application foundation for the research of interaction between sediment particles and ecological and environmental factors.",
    "pageCount": 412,
    "stock": 2,
    "publisher": "Springer Nature",
    "publishedDate": "2020-04-07",
    "lang": "en",
    "imgUrl": "http://books.google.com/books/content?id=597bDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "status": "available",
    "category": "Technology & Engineering",
    "pricePerWeek": 1995,
    "link": "http://books.google.co.id/books?id=597bDwAAQBAJ&printsec=frontcover&dq=bio&hl=&as_pt=BOOKS&cd=18&source=gbs_api"
  },
  {
    "title": "Blue Book of the State of Illinois",
    "isbn": "SRLF:AA0008066094",
    "author": "-",
    "pageCount": 596,
    "stock": 1,
    "publishedDate": "1989",
    "lang": "en",
    "imgUrl": "http://books.google.com/books/content?id=GLxWTomlm1oC&printsec=frontcover&img=1&zoom=1&source=gbs_api",
    "status": "available",
    "category": "Illinois",
    "pricePerWeek": 507,
    "link": "http://books.google.co.id/books?id=GLxWTomlm1oC&q=bio&dq=bio&hl=&as_pt=BOOKS&cd=19&source=gbs_api"
  },
  {
    "title": "Quantum Bio-Informatics II",
    "isbn": "9789814273756",
    "author": "L. Accardi",
    "synopsis": "The purpose of this proceedings volume is to look for interdisciplinary bridges in mathematics, physics, information and life sciences, in particular, research for new paradigms for information and life sciences on the basis of quantum theory. The main areas in this volume are all related to one of the following subjects: (1) mathematical foundation of quantum mechanics, (2) quantum information, (3) quantum algorithm and computation, (4) quantum communication, (5) white noise analysis and quantum dynamics, (6) chaos dynamics and adaptive dynamics, (7) experimental studies of quantum computer, (8) bio-informatics and (9) genome analysis.",
    "pageCount": 357,
    "stock": 1,
    "publisher": "World Scientific",
    "publishedDate": "2009-02-12",
    "lang": "en",
    "imgUrl": "http://books.google.com/books/content?id=3GxkDQAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "status": "available",
    "category": "Computers",
    "pricePerWeek": 1112,
    "link": "http://books.google.co.id/books?id=3GxkDQAAQBAJ&printsec=frontcover&dq=bio&hl=&as_pt=BOOKS&cd=20&source=gbs_api"
  },
  {
    "title": "Guide to Microforms in Print",
    "isbn": "CORNELL:31924069121717",
    "author": "-",
    "pageCount": 164,
    "stock": 1,
    "publishedDate": "1995",
    "lang": "en",
    "imgUrl": "http://books.google.com/books/content?id=01laAAAAYAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api",
    "status": "available",
    "category": "Microforms",
    "pricePerWeek": 4208,
    "link": "http://books.google.co.id/books?id=01laAAAAYAAJ&q=bio&dq=bio&hl=&as_pt=BOOKS&cd=21&source=gbs_api"
  },
  {
    "title": "Energy Technology 2019",
    "isbn": "9783030062095",
    "author": "Tao Wang, Xiaobo Chen, Donna Post Guillen, Lei Zhang, Ziqi Sun, Cong Wang, Nawshad Haque, John A. Howarter, Neale R Neelameggham, Shadia Ikhmayies, York R. Smith, L Tafaghodi, Amit Pandey",
    "synopsis": "This collection addresses the need for sustainable technologies with reduced energy consumption and pollutants and the development and application of alternative sustainable energy to maintain a green environment and energy supply. Contributions focus on energy-efficient technologies including innovative ore beneficiation, smelting technologies, and recycling and waste heat recovery, as well as emerging novel energy technologies. Papers also cover various technological aspects of sustainable energy ecosystems, processes that improve energy efficiency, reduce thermal emissions, and reduce carbon dioxide and other greenhouse emissions. Papers from the following symposia are presented in the book: Energy Technologies and Carbon Dioxide Management Solar Cell Silicon Advanced Materials for Energy Conversion and Storage",
    "pageCount": 308,
    "stock": 4,
    "publisher": "Springer",
    "publishedDate": "2019-02-09",
    "lang": "en",
    "imgUrl": "http://books.google.com/books/content?id=IUmHDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "status": "available",
    "category": "Technology & Engineering",
    "pricePerWeek": 2493,
    "link": "http://books.google.co.id/books?id=IUmHDwAAQBAJ&pg=PA14&dq=bio&hl=&as_pt=BOOKS&cd=22&source=gbs_api"
  },
  {
    "title": "How to Write a Professional Bio: For Authors, Speakers, and Entrepreneurs",
    "isbn": "0988888297",
    "author": "Jeniffer Thompson",
    "synopsis": "In \"How To Write A Professional BIO,\" personal branding expert, Jeniffer Thompson, walks you through ten easy steps with her proven Bio-Writing Formula, shares before and after examples, and provides worksheets to gently guide you through the process.",
    "pageCount": 112,
    "stock": 4,
    "publisher": "MCM Publishing",
    "publishedDate": "2019-11-12",
    "lang": "en",
    "imgUrl": "http://books.google.com/books/content?id=ZAVAzQEACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api",
    "status": "available",
    "category": "Business & Economics",
    "pricePerWeek": 4195,
    "link": "http://books.google.co.id/books?id=ZAVAzQEACAAJ&dq=bio&hl=&as_pt=BOOKS&cd=23&source=gbs_api"
  },
  {
    "title": "IBN",
    "isbn": "OSU:32435068395961",
    "author": "-",
    "pageCount": 770,
    "stock": 3,
    "publishedDate": "2002",
    "lang": "un",
    "imgUrl": "http://books.google.com/books/content?id=Zb5rhbm7qUsC&printsec=frontcover&img=1&zoom=1&source=gbs_api",
    "status": "available",
    "category": "Biography",
    "pricePerWeek": 3151,
    "link": "http://books.google.co.id/books?id=Zb5rhbm7qUsC&dq=bio&hl=&as_pt=BOOKS&cd=24&source=gbs_api"
  },
  {
    "title": "Natural Fiber-Reinforced Biodegradable and Bioresorbable Polymer Composites",
    "isbn": "9780081006696",
    "author": "Alan Kin-tak Lau, Ada Pui Yan Hung",
    "synopsis": "Natural Fiber-Reinforced Biodegradable and Bioresorbable Polymer Composites focuses on key areas of fundamental research and applications of biocomposites. Several key elements that affect the usage of these composites in real-life applications are discussed. There will be a comprehensive review on the different kinds of biocomposites at the beginning of the book, then the different types of natural fibers, bio-polymers, and green nanoparticle biocomposites are discussed as well as their potential for future development and use in engineering biomedical and domestic products. Recently mankind has realized that unless the environment is protected, he himself will be threatened by the over consumption of natural resources as well as a substantial reduction in the amount of fresh air produced in the world. Conservation of forests and the optimal utilization of agricultural and other renewable resources like solar, wind, and tidal energy, have become important topics worldwide. With such concern, the use of renewable resources—such as plant and animal-based, fiber-reinforced polymeric composites—are now becoming an important design criterion for designing and manufacturing components for a broad range of different industrial products. Research on biodegradable polymeric composites can contribute, to some extent, to a much greener and safer environment. For example, in the biomedical and bioengineering fields, the use of natural fiber mixed with biodegradable and bioresorbable polymers can produce joint and bone fixtures to alleviate pain in patients. Includes comprehensive information about the sources, properties, and biodegradability of natural fibers Discusses failure mechanisms and modeling of natural fibers composites Analyzes the effectiveness of using natural materials for enhancing mechanical, thermal, and biodegradable properties",
    "pageCount": 208,
    "stock": 2,
    "publisher": "Woodhead Publishing",
    "publishedDate": "2017-02-28",
    "lang": "en",
    "imgUrl": "http://books.google.com/books/content?id=YABQCwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "status": "available",
    "category": "Technology & Engineering",
    "pricePerWeek": 2977,
    "link": "http://books.google.co.id/books?id=YABQCwAAQBAJ&pg=PA46&dq=bio&hl=&as_pt=BOOKS&cd=25&source=gbs_api"
  },
  {
    "title": "Spectroscopy of Solid-State Laser-Type Materials",
    "isbn": "9781461308997",
    "author": "Baldassare Di Bartolo, Guzin Armagan",
    "synopsis": "This book presents an account of the course \"Spectroscopy of Solid-State Laser-Type Materials\" held in Erice, Italy, from June 16 to 30, 1985. This meeting was organized by the International School of Atomic and Molecular Spectroscopy of the \"Ettore Majorana\" Centre for Scientific Culture. The objective of the course was to present and examine the recent advances in spectroscopy and theoretical modelling relevant to the interpretation of luminescence and laser phenomena in several classes of solid-state materials. The available solid-state matrices (e.g. halides, oxides, glasses, semiconductors) and the full range of possible activators (transition ions, rare earth ions, post-transition ions, actinides, color centres) were considered. By bringing together specialists in the fields of solid-state luminescence and of solid-state laser materials, this course provided a much-needed forum for the critical . assessment of past developments in the R&D of solid-state lasers. Additional objectives of the meeting were to identify new classes of host/activator systems that show promise of laser operation; to alert researchers in solid-state luminescence to current technological needs for solid-state tunable lasers operating in the visible and infrared spectral regions; and generally to provide the scientific background for advanced work in solid state lasers. A total of 71 participants came from 54 laboratories and 21 nations (Austria, Belgium, Canada, F.R. of Germany, France, Greece, Ireland, Israel, Italy, the Netherlands, P.R. of China, Poland, Rumania, Sweden, Switzerland, South Korea, Spain, Turkey, United Kingdom, U.S.A. and U.S.S.R.).",
    "pageCount": 592,
    "stock": 1,
    "publisher": "Springer Science & Business Media",
    "publishedDate": "2012-12-06",
    "lang": "en",
    "imgUrl": "http://books.google.com/books/content?id=-jf2BwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "status": "available",
    "category": "Science",
    "pricePerWeek": 3949,
    "link": "http://books.google.co.id/books?id=-jf2BwAAQBAJ&pg=PA245&dq=bio&hl=&as_pt=BOOKS&cd=26&source=gbs_api"
  },
  {
    "title": "The Bookseller and the Stationery Trades' Journal",
    "isbn": "PRNC:32101065564401",
    "author": "-",
    "pageCount": 1644,
    "stock": 3,
    "publishedDate": "1923",
    "lang": "en",
    "imgUrl": "http://books.google.com/books/content?id=vWhVAAAAYAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api",
    "status": "available",
    "category": "Bibliography",
    "pricePerWeek": 56,
    "link": "http://books.google.co.id/books?id=vWhVAAAAYAAJ&q=bio&dq=bio&hl=&as_pt=BOOKS&cd=27&source=gbs_api"
  },
  {
    "title": "Advanced Materials",
    "isbn": "9783319789194",
    "author": "Ivan A. Parinov, Shun-Hsyung Chang, Vijay K. Gupta",
    "synopsis": "This book presents selected peer-reviewed contributions from the 2017 International Conference on “Physics and Mechanics of New Materials and Their Applications”, PHENMA 2017 (Jabalpur, India, 14–16 October, 2017), which is devoted to processing techniques, physics, mechanics, and applications of advanced materials. The book focuses on a wide spectrum of nanostructures, ferroelectric crystals, materials and composites as well as promising materials with special properties. It presents nanotechnology approaches, modern environmentally friendly piezoelectric and ferromagnetic techniques and physical and mechanical studies of the structural and physical–mechanical properties of materials. Various original mathematical and numerical methods are applied to the solution of different technological, mechanical and physical problems that are interesting from theoretical, modeling and experimental points of view. Further, the book highlights novel devices with high accuracy, longevity and extended capabilities to operate under wide temperature and pressure ranges and aggressive media, which show improved characteristics, thanks to the developed materials and composites, opening new possibilities for different physico-mechanical processes and phenomena.",
    "pageCount": 640,
    "stock": 4,
    "publisher": "Springer",
    "publishedDate": "2018-05-12",
    "lang": "en",
    "imgUrl": "http://books.google.com/books/content?id=LZZaDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "status": "available",
    "category": "Technology & Engineering",
    "pricePerWeek": 905,
    "link": "http://books.google.co.id/books?id=LZZaDwAAQBAJ&pg=PA624&dq=bio&hl=&as_pt=BOOKS&cd=28&source=gbs_api"
  },
  {
    "title": "The World of Organic Agriculture",
    "isbn": "9781136535239",
    "author": "Minou Yussefi-Menzler",
    "synopsis": "The new edition of this annual publication (previously published solely by IFOAM and FiBL) documents recent developments in global organic agriculture. It includes contributions from representatives of the organic sector from throughout the world and provides comprehensive organic farming statistics that cover surface area under organic management, numbers of farms and specific information about commodities and land use in organic systems. The book also contains information on the global market of the burgeoning organic sector, the latest developments in organic certification, standards and regulations, and insights into current status and emerging trends for organic agriculture by continent from the worlds foremost experts. For this edition, all statistical data and regional review chapters have been thoroughly updated. Completely new chapters on organic agriculture in the Pacific, on the International Task Force on Harmonization and Equivalence in Organic Agriculture and on organic aquaculture have been added. Published with IFOAM and FiBL",
    "pageCount": 268,
    "stock": 1,
    "publisher": "Routledge",
    "publishedDate": "2010-09-23",
    "lang": "en",
    "imgUrl": "http://books.google.com/books/content?id=laUeBAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "status": "available",
    "category": "Social Science",
    "pricePerWeek": 1092,
    "link": "http://books.google.co.id/books?id=laUeBAAAQBAJ&pg=PA137&dq=bio&hl=&as_pt=BOOKS&cd=29&source=gbs_api"
  },
  {
    "title": "Puteri Harum dan kaisar",
    "isbn": "UOM:39015062769032",
    "author": "Hua Wen",
    "pageCount": 142,
    "stock": 2,
    "publishedDate": "1961",
    "lang": "id",
    "imgUrl": "http://books.google.com/books/content?id=N6PhdL0GmBcC&printsec=frontcover&img=1&zoom=1&source=gbs_api",
    "status": "available",
    "category": "-",
    "pricePerWeek": 4809,
    "link": "http://books.google.co.id/books?id=N6PhdL0GmBcC&pg=RA6-PA43-IA2&dq=bio&hl=&as_pt=BOOKS&cd=30&source=gbs_api"
  },
  {
    "title": "Bio-Japan",
    "isbn": "WISC:89031126410",
    "author": "John Elkington",
    "pageCount": 124,
    "stock": 5,
    "publishedDate": "1985",
    "lang": "en",
    "imgUrl": "http://books.google.com/books/content?id=dbjxAAAAMAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api",
    "status": "available",
    "category": "Biotechnology",
    "pricePerWeek": 4449,
    "link": "http://books.google.co.id/books?id=dbjxAAAAMAAJ&q=bio&dq=bio&hl=&as_pt=BOOKS&cd=31&source=gbs_api"
  },
  {
    "title": "Dictionary of Early American Philosophers",
    "isbn": "9781441171405",
    "author": "John R. Shook",
    "synopsis": "The Dictionary of Early American Philosophers, which contains over 400 entries by nearly 300 authors, provides an account of philosophical thought in the United States and Canada between 1600 and 1860. The label of \"philosopher\" has been broadly applied in this Dictionary to intellectuals who have made philosophical contributions regardless of academic career or professional title. Most figures were not academic philosophers, as few such positions existed then, but they did work on philosophical issues and explored philosophical questions involved in such fields as pedagogy, rhetoric, the arts, history, politics, economics, sociology, psychology, medicine, anthropology, religion, metaphysics, and the natural sciences. Each entry begins with biographical and career information, and continues with a discussion of the subject's writings, teaching, and thought. A cross-referencing system refers the reader to other entries. The concluding bibliography lists significant publications by the subject, posthumous editions and collected works, and further reading about the subject.",
    "pageCount": 1288,
    "stock": 3,
    "publisher": "Bloomsbury Publishing USA",
    "publishedDate": "2012-04-05",
    "lang": "en",
    "imgUrl": "http://books.google.com/books/content?id=oOqoAwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "status": "available",
    "category": "Philosophy",
    "pricePerWeek": 2101,
    "link": "http://books.google.co.id/books?id=oOqoAwAAQBAJ&pg=PR33&dq=bio&hl=&as_pt=BOOKS&cd=32&source=gbs_api"
  },
  {
    "title": "Seri TEMPO: Amir Hamzah",
    "isbn": "9786024247010",
    "author": "TEMPO",
    "synopsis": "Dia konsisten mengamalkan amanat Kongres Pemuda II Oktober 1928 yang menahbiskan bahasa Melayu sebagai bahasa persatuan. Ketika Belanda berusaha mengubur bahasa Melayu sebagai bahasa persatuan, dia tetap berjuang mempopulerkan bahasa itu di masyarakat. Bermacam puisi, prosa, dan sajak lantas dia anggit dalam bahasa Indonesia. Dialah Amir Hamzah, raja penyair Pujangga Baru. Sajak-sajak Amir Hamzah, yang antara lain terhimpun dalam Nyanyi Sunyi dan Buah Rindu, menorehkan gaya baru pada bahasa Indonesia. Kata-kata dalam sajaknya berkesan kemas, ganas, tajam, dan pendek. Berbahasa tinggi sekaligus berjiwa halus. Meski turut memperjuangkan kebebasan negeri ini dari kolonialisme, dia dituduh pernah menjadi intel Belanda. Dia pun terjepit di antara silsilah keturunan bangsawan dan gelombang keberpihakan kepada Indonesia. Ketika Republik belum genap berusia setahun, Amir Hamzah menjadi tumbal dalam Revolusi Langkat di Sumatera Timur pada 1946. Hidup penyair bergelar pahlawan nasional ini berakhir di tangan pemuda dari kalangan sosialis. Kisah tentang Amir Hamzah adalah jilid pertama seri “Tokoh Seni dalam Pusaran Politik” yang diangkat dari liputan khusus Majalah Berita Mingguan Tempo, Agustus 2017. Serial ini menyajikan seuntaian jejak kesenimanan tokoh-tokoh yang hidup di tengah situasi politik yang kaos. Hidup dan karya mereka merespons secara aktif dinamika politik yang melingkunginya.",
    "pageCount": 128,
    "stock": 3,
    "publisher": "Kepustakaan Populer Gramedia",
    "publishedDate": "2021-12-10",
    "lang": "id",
    "imgUrl": "http://books.google.com/books/content?id=7W1UEAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "status": "available",
    "category": "Biography & Autobiography",
    "pricePerWeek": 2270,
    "link": "http://books.google.co.id/books?id=7W1UEAAAQBAJ&printsec=frontcover&dq=bio&hl=&as_pt=BOOKS&cd=33&source=gbs_api"
  },
  {
    "title": "Proceedings of the MRS International Meeting on Advanced Materials: Superconductivity",
    "isbn": "PSU:000023056619",
    "author": "Masao Dōyama",
    "pageCount": 1072,
    "stock": 3,
    "publishedDate": "1989",
    "lang": "en",
    "imgUrl": "http://books.google.com/books/content?id=OyRZAAAAYAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api",
    "status": "available",
    "category": "Materials",
    "pricePerWeek": 4897,
    "link": "http://books.google.co.id/books?id=OyRZAAAAYAAJ&q=bio&dq=bio&hl=&as_pt=BOOKS&cd=34&source=gbs_api"
  },
  {
    "title": "Mathematical Methods in Chemical and Biological Engineering",
    "isbn": "9781482210392",
    "author": "Binay Kanti Dutta",
    "synopsis": "Mathematical Methods in Chemical and Biological Engineering describes basic to moderately advanced mathematical techniques useful for shaping the model-based analysis of chemical and biological engineering systems. Covering an ideal balance of basic mathematical principles and applications to physico-chemical problems, this book presents examples drawn from recent scientific and technical literature on chemical engineering, biological and biomedical engineering, food processing, and a variety of diffusional problems to demonstrate the real-world value of the mathematical methods. Emphasis is placed on the background and physical understanding of the problems to prepare students for future challenging and innovative applications.",
    "pageCount": 694,
    "stock": 5,
    "publisher": "CRC Press",
    "publishedDate": "2016-11-03",
    "lang": "en",
    "imgUrl": "http://books.google.com/books/content?id=z2kNDgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "status": "available",
    "category": "Mathematics",
    "pricePerWeek": 432,
    "link": "http://books.google.co.id/books?id=z2kNDgAAQBAJ&pg=PA24&dq=bio&hl=&as_pt=BOOKS&cd=35&source=gbs_api"
  },
  {
    "title": "Developing the Global Bioeconomy",
    "isbn": "9780128052907",
    "author": "Patrick Lamers, Erin Searcy, J. Richard Hess, Heinz Stichnothe",
    "synopsis": "Developing the Global Bioeconomy: Technical, Market, and Environmental Lessons from Bioenergy brings together expertise from three IEA-Bioenergy subtasks on pyrolysis, international trade, and biorefineries to review the bioenergy sector and draw useful lessons for the full deployment of the bioeconomy. Despite the vast amount of politically driven strategies, there is little understanding on how current markets will transition towards a global bioeconomy. The question is not only how the bioeconomy can be developed, but also how it can be developed sustainably in terms of economic and environmental concerns. To answer this question, this book’s expert chapter authors seek to identify the types of biorefineries that are expected to be implemented and the types of feedstock that may be used. They also provide historical analysis of the developments of biopower and biofuel markets, integration opportunities into existing supply chains, and the conditions that would need to be created and enhanced to achieve a global biomass trade system that could support a global bioeconomy. As expectations that a future bioeconomy will rely on a series of tradable commodities, this book provides a central accounting of the state of the discussion in a multidisciplinary approach that is ideal for research and academic experts, and analysts in all areas of the bioenergy, biofuels, and bioeconomy sectors, as well as those interested in energy policy and economics. Examines the lessons learned by the bioenergy industry and how they can be applied to the full development of the bioeconomy Explores different transition strategies and how the current fossil based and future bio-based economy are intertwined Reviews the status of current biomass conversion pathways Presents an historical analysis of the developments of biopower and biofuel markets, integration opportunities into existing supply chains, and the conditions that would need to be created and enhanced to achieve a global biomass trade system",
    "pageCount": 220,
    "stock": 3,
    "publisher": "Academic Press",
    "publishedDate": "2016-05-02",
    "lang": "en",
    "imgUrl": "http://books.google.com/books/content?id=gTqOCgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "status": "available",
    "category": "Technology & Engineering",
    "pricePerWeek": 296,
    "link": "http://books.google.co.id/books?id=gTqOCgAAQBAJ&printsec=frontcover&dq=bio&hl=&as_pt=BOOKS&cd=36&source=gbs_api"
  },
  {
    "title": "Official Journal of the European Communities",
    "isbn": "UOM:39015074622120",
    "author": "-",
    "pageCount": 1124,
    "stock": 5,
    "publishedDate": "1980-04",
    "lang": "en",
    "imgUrl": "http://books.google.com/books/content?id=E2kNAQAAMAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api",
    "status": "available",
    "category": "European federation",
    "pricePerWeek": 3515,
    "link": "http://books.google.co.id/books?id=E2kNAQAAMAAJ&q=bio&dq=bio&hl=&as_pt=BOOKS&cd=37&source=gbs_api"
  },
  {
    "title": "JARQ.",
    "isbn": "WISC:89098849797",
    "author": "-",
    "pageCount": 598,
    "stock": 1,
    "publishedDate": "2001",
    "lang": "en",
    "imgUrl": "http://books.google.com/books/content?id=siXvBXvdy4oC&printsec=frontcover&img=1&zoom=1&source=gbs_api",
    "status": "available",
    "category": "Agriculture",
    "pricePerWeek": 3881,
    "link": "http://books.google.co.id/books?id=siXvBXvdy4oC&q=bio&dq=bio&hl=&as_pt=BOOKS&cd=38&source=gbs_api"
  },
  {
    "title": "Biomass Combustion Science, Technology and Engineering",
    "isbn": "9780857097439",
    "author": "Lasse Rosendahl",
    "synopsis": "The utilisation of biomass is increasingly important for low- or zero-carbon power generation. Developments in conventional power plant fuel flexibility allow for both direct biomass combustion and co-firing with fossil fuels, while the integration of advanced technologies facilitates conversion of a wide range of biomass feedstocks into more readily combustible fuel. Biomass combustion science, technology and engineering reviews the science and technology of biomass combustion, conversion and utilisation. Part one provides an introduction to biomass supply chains and feedstocks, and outlines the principles of biomass combustion for power generation. Chapters also describe the categorisation and preparation of biomass feedstocks for combustion and gasification. Part two goes on to explore biomass combustion and co-firing, including direct combustion of biomass, biomass co-firing and gasification, fast pyrolysis of biomass for the production of liquids and intermediate pyrolysis technologies. Largescale biomass combustion and biorefineries are then the focus of part three. Following an overview of large-scale biomass combustion plants, key engineering issues and plant operation are discussed, before the book concludes with a chapter looking at the role of biorefineries in increasing the value of the end-products of biomass conversion. With its distinguished editor and international team of expert contributors, Biomass combustion science, technology and engineering provides a clear overview of this important area for all power plant operators, industrial engineers, biomass researchers, process chemists and academics working in this field. Reviews the science and technology of biomass combustion, conversion and utilisation Provides an introduction to biomass supply chains and feedstocks and outlines the principles of biomass combustion for power generation Describes the categorisation and preparation of biomass feedstocks for combustion and gasification",
    "pageCount": 320,
    "stock": 2,
    "publisher": "Elsevier",
    "publishedDate": "2013-04-04",
    "lang": "en",
    "imgUrl": "http://books.google.com/books/content?id=MVtEAgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "status": "available",
    "category": "Technology & Engineering",
    "pricePerWeek": 3917,
    "link": "http://books.google.co.id/books?id=MVtEAgAAQBAJ&pg=PA165&dq=bio&hl=&as_pt=BOOKS&cd=39&source=gbs_api"
  },
  {
    "title": "Education, Power, and Personal Biography",
    "isbn": "9781136788352",
    "author": "Carlos Torres Alberto",
    "synopsis": "In dialogues with key thinkers in the area of critical education, this book documents how a tradition of study grew in the United States. Through in-depth interviews, the author asks each of these thinkers to talk about the relationship between their personal experiences and their academic work. The reader will learn, through listening to these intellectual, political and personal biographies, how and why these individual scholars have struggled for more than three decades to expand the borders of critical education studies. Interviews are held with Henry Giroux, Henry Levin, Herbert Gintis, Jeannie Oakes, Martin Carnoy, Maxine Greene, Michael Apple, Samuel Bowles, Paulo Freire, Gloria Lanson-Billings and Geoff Whitty, among others.",
    "pageCount": 337,
    "stock": 2,
    "publisher": "Routledge",
    "publishedDate": "1997-12-03",
    "lang": "en",
    "imgUrl": "http://books.google.com/books/content?id=ITaBAAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "status": "available",
    "category": "Education",
    "pricePerWeek": 304,
    "link": "http://books.google.co.id/books?id=ITaBAAAAQBAJ&printsec=frontcover&dq=bio&hl=&as_pt=BOOKS&cd=40&source=gbs_api"
  }
]